[
  {
    "publisher": "DC COMICS",
    "description": "Includes new stories plus classic reprints!",
    "title": "FLASH GIANT #4",
    "price": "$4.99",
    "creators": "",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200528"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "Explore the living history of Tyria through an expansive collection of never-before-seen concept art, production material, and creator commentary from Guild Wars and Guild Wars 2 that offers exclusive insight into an ever-changing world inhabited by millions of players! The continuing growth of the Guild Wars franchise is detailed by the ArenaNet artists themselves in a volume that commemorates the studio's twentieth anniversary.   o The perfect companion piece for the millions of Guild Wars players.   o A complete book containing art from both games, and every installment.  ",
    "title": "ART OF GUILD WARS COMPLETE ARENANET 20TH ANN ED HC",
    "price": "$39.99",
    "creators": "(W) ArenaNet",
    "release_date": "2020-05-27",
    "diamond_id": "NOV190285"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "In the leadup to the celebrated series Frankenstein Underground, the \"monster\" Frankenstein continues his journey northward. Still trapped between the weight of his guilt and desire for redemption, Frankenstein may have to choose once and for all when an encounter with the crew of an icebound ship leads him into danger on the ice! ",
    "title": "FRANKENSTEIN UNDONE #2 (OF 5) CVR A STENBECK",
    "price": "$3.99",
    "creators": "(W) Mike Mignola, Scott Allie (A/CA) Ben Stenbeck",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190290"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "In the leadup to the celebrated series Frankenstein Underground, the \"monster\" Frankenstein continues his journey northward. Still trapped between the weight of his guilt and desire for redemption, Frankenstein may have to choose once and for all when an encounter with the crew of an icebound ship leads him into danger on the ice! ",
    "title": "FRANKENSTEIN UNDONE #2 (OF 5) CVR B D ARMINI",
    "price": "$3.99",
    "creators": "(W) Mike Mignola, Scott Allie (A) Ben Stenbeck (CA) Simone D'Armini",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190291"
  },
  {
    "publisher": "DC COMICS",
    "description": "Apex Lex Luthor's first run-in with the Infected didn't go as planned, and the Batman Who Laughs' influence is continuing to spread. Now Lex must find out who in the world can think like the Batman Who Laughs-and there are only two folks who come to mind. The first is Batman, who probably has his own ideas for Lex; the other is The Joker, who also likely has his own ideas, but who just maybe wants to see this twisted doppelg&#228;nger sent back to the Dark Multiverse he came from. It's a gamble Lex has to take, because the Infected are gearing up for round two!",
    "title": "YEAR OF THE VILLAIN HELL ARISEN #3 (OF 4) 3RD PTG",
    "price": "$4.99",
    "creators": "(W) James TynionIV (A) Javi Fernandez (A/CA) Steve Epting",
    "release_date": "2020-05-27",
    "diamond_id": "JAN209134"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "Go higher, further, and faster with Captain Marvel and the Unstoppable Wasp in a brand-new, middle grade adventure!  Carol and Nadia, currently no bigger than, well, a wasp, are in a predicament-A.I.M. is up to no good, and Carol can't use her powers because, at this size, she could literally split atoms. Yikes! So what's the strongest avenger to do? Well, Carol has a lot of ideas-but maybe it's best if she follows Nadia's lead on this one... cue: the G.I.R.L. squad!   Enter the secret world of Captain Marvel in this pint-sized Marvel Action adventure! ",
    "title": "MARVEL ACTION CAPTAIN MARVEL #5 CVR A BOO",
    "price": "$3.99",
    "creators": "(W) Sam Maggs (A/CA) Sweeney Boo",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190696"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "The last issue of the original run is here! It's been a full year since the events that set in motion the Turtles' journey, and as they gather together to celebrate their birthdays, they get disturbing news from Pimiko-the Foot Clan has turned on Raph! Will they be able to rescue their brother from the clutches of the mysterious new Shredder in time? ",
    "title": "TMNT URBAN LEGENDS #23 CVR A FOSCO",
    "price": "$3.99",
    "creators": "(W) Gary Carlson (A/CA) Frank Fosco",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200711"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "The last issue of the original run is here! It's been a full year since the events that set in motion the Turtles' journey, and as they gather together to celebrate their birthdays, they get disturbing news from Pimiko-the Foot Clan has turned on Raph! Will they be able to rescue their brother from the clutches of the mysterious new Shredder in time? ",
    "title": "TMNT URBAN LEGENDS #23 CVR B FOSCO & LARSEN",
    "price": "$3.99",
    "creators": "(W) Gary Carlson (CA) Erik Larsen (A/CA) Frank Fosco",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200712"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "Mer's budding romance with Nuon gives her hope for the future, while her cousin Lucas confronts his past. Reality sets in as Nuon struggles to keep her identity a secret and Mer makes a shocking discovery.",
    "title": "20XX #4 (MR)",
    "price": "$3.99",
    "creators": "(W) Lauren Keely, Jonathan Luna (A/CA) Jonathan Luna",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200255"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "It's Samantha's turn with Chip-the dangerous alien-but everything starts to go wrong when she instigates a confrontation with her ex-boyfriend. Scared and angry, Samantha struggles with the decision to use Chip's powers for her own benefit. But not even she knows what the true consequences will be...",
    "title": "ALIENATED #3 (OF 6)",
    "price": "$3.99",
    "creators": "(W) Simon Spurrier (A/CA) Chris Wildgoose",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201322"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "Zack, and Trini are leaving Earth to officially join THE OMEGA RANGERS, but it means their former team is now down three people, with Lord Zedd about to launch his ultimate weapon! Zordon and Alpha-5 search desperately for worthy successors, but will it be enough to stop the enemy?",
    "title": "GO GO POWER RANGERS #31 CVR A CARLINI CONNECTING",
    "price": "$3.99",
    "creators": "(W) Ryan Parrott, Sina Grace (A) Francesco Mortarino (CA) Eleonora Carlini",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201283"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "Now an honorary citizen of Nowhere, Denis joins one of the locals on a doomed-to-fail money-making scheme at the outskirts of town, while John Doe's mysterious killer continues to leave bodies in his wake... ",
    "title": "KING OF NOWHERE #2 (OF 5) CVR A JENKINS",
    "price": "$3.99",
    "creators": "(W) Maxwell Prince (A/CA) Tyler Jenkins",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201315"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "Now an honorary citizen of Nowhere, Denis joins one of the locals on a doomed-to-fail money-making scheme at the outskirts of town, while John Doe's mysterious killer continues to leave bodies in his wake... ",
    "title": "KING OF NOWHERE #2 (OF 5) CVR B MORAZZO",
    "price": "$3.99",
    "creators": "(W) Maxwell Prince (A) Tyler Jenkins (CA) Martin Morazzo",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201316"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "* The Mighty Morphin Power Rangers are back in Angel Grove...with the White Ranger as their leader! But what happened to the team after they defeated Lord Drakkon? And what does the White Ranger's first appearance mean for the future of the team? * The new series creative team of writer Ryan Parrott (Go Go Power Rangers) and artist Daniele Di Nicuolo (Power Rangers: Shattered Grid) begin a bold new era as those answers-and more shocking secrets-are revealed for the very first time! * Collects issues #40-43.",
    "title": "MIGHTY MORPHIN POWER RANGERS TP VOL 11",
    "price": "$16.99",
    "creators": "(W) Ryan Parrott (A) Daniele Nicuolo (CA) Jamal Campbell",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191268"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "The students learn about the Dark Wisdom conspiracy, but can they warn everyone else about the planned attack on Dean Ogden's midnight funeral? Probably not, because we still have an issue to go! Also: Chimp Ho Tep's second escape attempt, an occult heist scheme, scrying, dying, corpse dumping, a dead art student, and the meat from space that eats your face. WTF? ",
    "title": "BLACKWOOD MOURNING AFTER #3 (OF 4) CVR A FISH",
    "price": "$3.99",
    "creators": "(W) Evan Dorkin (A/CA) Veronica Fish",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200278"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "The students learn about the Dark Wisdom conspiracy, but can they warn everyone else about the planned attack on Dean Ogden's midnight funeral? Probably not, because we still have an issue to go! Also: Chimp Ho Tep's second escape attempt, an occult heist scheme, scrying, dying, corpse dumping, a dead art student, and the meat from space that eats your face. WTF? ",
    "title": "BLACKWOOD MOURNING AFTER #3 (OF 4) CVR B MOMOKO",
    "price": "$3.99",
    "creators": "(W) Evan Dorkin (A) Veronica Fish (CA) Peach Momoko",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200279"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "Behind bars, Petiot proclaims himself a resistance fighter and patriot. As the trial begins, a new spectacle presents itself. With the magnitude of the murders coming to light, what possible justice can be served?  \"The Butcher of Paris is a gruesome, chilling and nearly hopeless story that is full of genuine horror.\" -The Brazen Bull",
    "title": "BUTCHER OF PARIS #5 (OF 5) (MR)",
    "price": "$3.99",
    "creators": "(W) Stephanie Phillips (A) Dean Kotz (CA) Dave Johnson",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200283"
  },
  {
    "publisher": "DC COMICS",
    "description": "It's time for a final swing of the axe. In the darkest, coldest hours of the night, June Branch finds herself up against the deadeyed killer who abducted her lover...and comes face to face with some truths even more horrifying than a basketful of heads.",
    "title": "BASKETFUL OF HEADS #7 (OF 7) (MR)",
    "price": "$3.99",
    "creators": "(W) Joe Hill (A) Leomacs (CA) Reiko Murakami",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200510"
  },
  {
    "publisher": "DC COMICS",
    "description": "Batman goes over the edge! With everything that's happened in Gotham City and Ra's al Ghul's personal attacks on the Dark Knight and his team of Outsiders, Batman lashes out and uses his all his anger and skills to take down Ra's and his new League of Assassins on his own. Will the Outsiders be able to pull him back from his rage-or will they find themselves on the receiving end of it?",
    "title": "BATMAN AND THE OUTSIDERS #12",
    "price": "$3.99",
    "creators": "(W) Bryan Hill (A) Dexter Soy (CA) Tyler Kirkham",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200434"
  },
  {
    "publisher": "DC COMICS",
    "description": "Terry McGinnis has his memories back, and he's ready to resume his duties as Batman in Neo-Gotham. But as soon as he comes home, so does Goliath, the Man-Bat pet of Damian Wayne. What adventure with the heir of the Demon lies in store for Batman Beyond?",
    "title": "BATMAN BEYOND #43",
    "price": "$3.99",
    "creators": "(W) Dan Jurgens (A) Sean Chen, Sean Parsons (CA) Dustin Nguyen",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200436"
  },
  {
    "publisher": "DC COMICS",
    "description": "All Tim wanted to do was impress a pretty girl by getting the two of them into the Glastonbury Festival. But one poorly thought-out spell later, they've instead found themselves at a different festival-the ancient carnival of the realms, where all the worlds of magic go to let their hair (or tentacles, or tendrils of fire) down and have a good time! It's just a shame that for some species, \"a good time\" might turn out to mean \"eating humans\"...Don't miss the start of this two-part tale written by guest writer David Barnett (Punks Not Dead).",
    "title": "BOOKS OF MAGIC #19 (MR)",
    "price": "$3.99",
    "creators": "(W) David Barnett (A) Tom Fowler, Craig A. Taillefer (CA) Kai Carpenter",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200520"
  },
  {
    "publisher": "DC COMICS",
    "description": "This 1977 issue features the debut of Huntress, the untold origin of Green Arrow, and an early adventure of the Legion of Super-Heroes! Offered to coincide with the Catwoman 80th Anniversary 100-Page Super Spectacular #1.",
    "title": "DC SUPER STARS #17 FACSIMILE EDITION",
    "price": "$4.99",
    "creators": "(W) Paul Levitz, Dennis O'Neil, Jack C. Harris (A) Mike Grell, Juan Ortiz, Others (A/CA) Joe Staton, Bob Layton",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200525"
  },
  {
    "publisher": "DC COMICS",
    "description": "In this \"Flash Age\" interlude, the Fastest Man Alive must find the Reverse-Flash to stop Paradox's annihilation of the Flash legacy. But catching a time-traveler is extremely difficult, and the Flash's quest to find Eobard Thawne takes him to tragic moments in time he never thought he'd have to revisit.",
    "title": "FLASH #753",
    "price": "$3.99",
    "creators": "(W) Joshua Williamson (CA) Howard Porter, Howard Porter",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200445"
  },
  {
    "publisher": "DC COMICS",
    "description": "The Flash is on the run as \"The Flash Age\" continues! Paradox accomplished his mission to make everyone see the Flash as a monster-and now Flash and the Reverse-Flash are trapped in a 25th century Central City that hates the Flash family and legacy. Now a wanted man, Flash must turn to an unexpected place to get help to return to his own time!",
    "title": "FLASH #754",
    "price": "$3.99",
    "creators": "(W) Joshua Williamson (A) Christian Duce (CA) Rafael Sandoval, Jordi Tarragona",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200447"
  },
  {
    "publisher": "DC COMICS",
    "description": "Grant Morrison and Liam Sharp continue their master class in comic book entertainment as Hal Jordan remains grounded on Earth by the Young Guardians. But when U.S. Air Force general \"Herc\" Stone reenlists \"Highball\" Jordan for a mission to locate his missing pilots, including Hal's ex Cowgirl, Jordan discovers an alien presence more dangerous than any stormy relationship!",
    "title": "GREEN LANTERN SEASON 2 #3",
    "price": "$3.99",
    "creators": "(W) Grant Morrison (A/CA) Liam Sharp",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200451"
  },
  {
    "publisher": "DC COMICS",
    "description": "Cloaked in black and wearing the eerie mask of a hawk, the mysterious Plague Doctor roams 17th century Europe in an attempt to ease the suffering of those who fall victim to the Black Death. But how is the Doctor supposed to help anyone when he's hated and feared for his unique immunity to the disease? It's mind versus body as Carter Hall relives his most tragic past life in a last stand to fight off Sky Tyrant's control over his body for good!",
    "title": "HAWKMAN #23",
    "price": "$3.99",
    "creators": "(W) Robert Venditti (A) Marcio Takara, Fernando Pasarin (CA) Mikel Janin",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200457"
  },
  {
    "publisher": "DC COMICS",
    "description": "It's the finale of the reality-bending miniseries, and Prince Keldor is trapped in the bowels of Castle Hellskull. Now the only way to survive an onslaught of Anti-Eternians may be to embrace the full powers of Skeletor!",
    "title": "HE MAN AND THE MASTERS OF THE MULTIVERSE #6 (OF 6)",
    "price": "$3.99",
    "creators": "(W) Tim Seeley (A) Tom Derenick (CA) In-Hyuk Lee",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200459"
  },
  {
    "publisher": "DC COMICS",
    "description": "The divine houseboat that is the House of Whispers has always obeyed Erzulie's commands-but now it has begun its own journey, trapping Erzulie aboard with her ex-husbands...and sailing on a collision course with an entire fleet of ghostly slave ships bound for Guin&#233;e, the land of the dead!",
    "title": "HOUSE OF WHISPERS #20 (MR)",
    "price": "$3.99",
    "creators": "(W) Nalo Hopkinson, Dan Watters (A) Dominike \"Domo\" Stanton (CA) Marcio Takara",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200522"
  },
  {
    "publisher": "DC COMICS",
    "description": "DC BLACK LABEL AGES 17+ When murder is your art, it's not enough to leave behind a body-the only true satisfaction lies in creating a display worthy of your genius. But elaborate crime scenes also lend themselves to analysis. While the GCPD might not find all the clues, forensic psychiatrist and profiler Harley Quinn is getting closer to the truth...and the killer.8.5\" x ",
    "title": "JOKER HARLEY CRIMINAL SANITY #4 (OF 9) (MR)",
    "price": "$5.99",
    "creators": "(W) Kami Garcia (A) Jason Badower, Mico Suayan (CA) Francesco Mattina",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200460"
  },
  {
    "publisher": "DC COMICS",
    "description": "The Spirit of Vengeance goes global! After spending untold time in isolation, the Spectre is back, and his thirst for retribution will ripple across the Earth! As old wounds are reopened under the Spectre's unstoppable influence, it's up to the Justice League to stop the conflict. But how can they act on a global stage when they must first contend with their own resentments?",
    "title": "JUSTICE LEAGUE #45",
    "price": "$3.99",
    "creators": "(W) Robert Venditti (A) Eddy Barrows (CA) Francis Manapul",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200464"
  },
  {
    "publisher": "DC COMICS",
    "description": "Octavia and El's search for their missing memories comes to a head when the terrible secrets of Shudder-to-Think, Pennsylvania's past are revealed at last.",
    "title": "LOW LOW WOODS #5 (OF 6) (MR)",
    "price": "$3.99",
    "creators": "(W) Carmen Maria Machado (A) Dani (CA) Sam Wolfe Connelly",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200516"
  },
  {
    "publisher": "DC COMICS",
    "description": "This issue includes these new stories:   o \"Medal of Honor,\" an 8-page story featuring Batman written by Sal Giunta and Brad Meltzer with art by Jim Lee and Scott Williams   To save a friend from seemingly insurmountable odds, the Dark Knight Detective my summon every ounce of his skill and bravery! This tale is based on the true story of U.S. Army Specialist Salvatore A. Giunta, who was awarded the Medal of Honor for his service in Afghanistan-the first living soldier to receive that honor during the Global War on Terrorism.   o \"House Call,\" a 16-page story featuring the Unknown Soldier written by Christopher Priest with art by Christopher Mooneyham  A cable news reporter with a mysterious U.S. Army tactical unit tries to figure out which one of the team's members is the immortal covert operative code-named the Unknown Solder-and discovers much more than she bargained for!   o \"Code of Honor,\" an 8-page story featuring Batwoman written by Larry Hama with art by Mirko Colak  Katherine Kane has worked hard to establish herself as one of Gotham's most intelligent and strategically cunning vigilantes. But before she was Batwoman, she was as West Point cadet-and when she gets drafted into a covert missiong as brigade XO, she'll need every bit of training that the Army gave her!   o New cover by Mikel Jan n  Plus, these reprint tales:   o \"Frozen,\" from Men of War #4 (2012) o \"Knife Fight!,\" from Men of War #5 (2012) o \"A Last, Full Measure,\" from Men of War #6 (2012)  o \"Remembering the Leopard,\" from Men of War #7 (2012) o \"Survival Mode,\" from Men of War #7 (2012) ",
    "title": "OUR FIGHTING FORCES GIANT #1",
    "price": "$4.99",
    "creators": "(W) Sal Guinta, Brian Meltzer, Christopher Priest, Larry Hama (A) Jim Lee, Chris Mooneyham, Mirko Colak",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200529"
  },
  {
    "publisher": "DC COMICS",
    "description": "They say loose lips sink ships-and Captain Boomerang has the biggest mouth on Earth! That's why Lok commands Task Force X to bring him in andshut him up for good! The hunt is on, but nothing ever goes according to plan in the Suicide Squad-at least, not if Osita and her mutinous Revolutionaries can help it. Will Deathstroke and Harley finally turn against Lok when ordered to kill their old Squad-mate? One way or another, the bodies keep dropping...",
    "title": "SUICIDE SQUAD #5",
    "price": "$3.99",
    "creators": "(W) Tom Taylor (A/CA) Bruno Redondo",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200489"
  },
  {
    "publisher": "DC COMICS",
    "description": "The fan-favorite series is collected in omnibus format! The Man of Steel and the Dark Knight unite when President Lex Luthor accuses Superman of a crime against humanity, and assembles a team of powerhouse heroes to bring Superman in-dead or alive. Plus, prepare for the arrival of Supergirl! Batman has discovered something strange at the bottom of Gotham Bay, which leads him to a mysterious and powerful teenage girl bent on destroying Gotham City! Collects issues #1-43, plus Superman/Batman Secret Files #1, and Annual #1 and #2.",
    "title": "SUPERMAN BATMAN OMNIBUS HC VOL 01",
    "price": "$125.00",
    "creators": "(W) Jeph Loeb, Mark Verheiden, Others (A) Michael Turner, Dustin Nguyen, Others (CA) Dexter Vines (A/CA) Ed McGuinness",
    "release_date": "2020-05-27",
    "diamond_id": "SEP190601"
  },
  {
    "publisher": "DC COMICS",
    "description": "At the gates of heaven itself, the Teen Titans must battle Djinn's older brother Elias with the fate of the world hanging in the balance! But victory comes at a terrible cost-because one of the Teen Titans won't be making it back!",
    "title": "TEEN TITANS #41",
    "price": "$3.99",
    "creators": "(W) Adam Glass, Robbie Thompson (A) Eduardo Pansica, Julio Ferreira (CA) Bernard Chang",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200497"
  },
  {
    "publisher": "DC COMICS",
    "description": "Scientists of the world unite! When Simon Stagg sabotages Mr. Terrific's latest world-changing invention, reinforcements are needed. Enter the Terrific Council: Blue Beetle! The Atom! Man-Bat! Shay Veritas! Dhalua Strong! (Just hum a theme song in your head, it'll be more exciting that way.) Looks like Michael Holt has been building a real path to progress behind the backs of his Terrific comrades-but the real question is, what else is he planning?",
    "title": "TERRIFICS #27",
    "price": "$3.99",
    "creators": "(W) Gene Luen Yang (A) Sergio Davila, Vicente Cifuentes (CA) Dan Mora",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200500"
  },
  {
    "publisher": "DC COMICS",
    "description": "onder Woman Giant #4 includes these new stories:  * \"Hope Springs Eternal,\" a 16-page story written by Jimmy Palmiotti and Amanda Conner with art by Daniel Sampere and Juan Albarran  Wonder Woman visits an old friend on her last day, but afterward, Diana's day turns into a nightmare. Meanwhile, the Penguin gathers a group of villains to enact a new plan against their heroic enemies! * \"Gundra the Great,\" an 8-page story written by Jeff Parker with art by Aneke  Wonder Woman responds to a distress call in a tiny village and discovers a displaced Valkyrie from Asgard, but is she friend...or foe?  * New cover by Mikel Jan&#195;n \"Year One part four,\" from Wonder Woman #10 (2017)  * \"Secret Origin part four,\" from Green Lantern #32 (2008)  * \"The Catalyst part four,\" from Sword of Sorcery #3 (2013) ",
    "title": "WONDER WOMAN GIANT #4",
    "price": "$4.99",
    "creators": "(W) Jimmy Palmiotti, Amanda Conner, Jeff Parker (A) Daniel Sampere, Juan Albarran, Aneke (CA) Mikel Janin",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200531"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "A mission to smuggle vital intelligence to Free Canada goes sideways when Fadeaway confronts someone from her past working in Cobra! The bonds of friendship are tested when lives are at stake!  The world of G.I. Joe expands in this turning point issue!",
    "title": "GI JOE #6 CVR A EVENHUIS",
    "price": "$3.99",
    "creators": "(W) Paul Allor (A/CA) Chris Evenhuis",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190669"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "NOW BACK IN PRINT! Giant monsters are appearing across the globe and leaving complete devastation in their wake. But who-or what-might be behind their attacks? It's up to Commander Steven Woods and his Counter-Kaiju Reaction forces to hold the monsters at bay, while young Lucy Casprell and her scientific research group, the Kaiju Watchers, attempt to find the truth behind the invasions. Collects the first 12 issues of the series.",
    "title": "GODZILLA COMP RULERS OF EARTH TP VOL 01 NEW ED",
    "price": "$29.99",
    "creators": "(W) Chris Mowry (A) Jeff Zornow (A/CA) Matt Frank",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200707"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "Witness the Aftermath of the stunning second season of Star Trek: Discovery! An all-new graphic novel that ties directly into Season Two of the hit CBS All Access series!  After the disappearance of the U.S.S. Discovery, Captain Pike and Chancellor L'Rell seek to forge a peace treaty between the Federation and the Klingons. But when a new enemy threatens to sabotage the negotiations, Spock must reclaim his place in Starfleet to save his friends and prevent the outbreak of a new war!  Available in April. Written by fan-favorite Mike Johnson (Star Trek: Picard Countdown, Star Trek: Boldly Go) and Star Trek: Discovery Co-Producer Kirsten Beyer!",
    "title": "STAR TREK DISCOVERY TP AFTERMATH",
    "price": "$15.99",
    "creators": "(W) Kirsten Beyer, Mike Johnson (A) Tony Shasteen (CA) Angel Hernandez",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190645"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "ADVANCE SOLICIT  The Eververse is collapsing under its own weight. Grant McKay created the Pillar to save the world with science, and now he must use it to save all worlds, all of creation, or doom reality itself to oblivion.   The Anarchist League of Scientists charges forward for one final adventure as RICK REMENDER and MATTEO SCALERA bring their seminal pulp science fiction epic to a mind-shattering finale.  Collects BLACK SCIENCE #31-43",
    "title": "BLACK SCIENCE PREMIERE HC VOL 03 (MR)",
    "price": "$49.99",
    "creators": "(W) Rick Remender (A/CA) Matteo Scalera, Moreno DiNisio",
    "release_date": "2020-05-27",
    "diamond_id": "OCT190094"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "NEW STORY ARC! EXORSISTERS returns for a second arc! In this issue, Cate finds herself in a world where her mother saved her instead of selling her soul, while Kate has taken over Hell as its new ruler. Has Cate lost her \"sister\" again?",
    "title": "EXORSISTERS #6 CVR A LAGACE & PANTAZIS",
    "price": "$3.99",
    "creators": "(W) Ian Boothby (A/CA) Gisele Lagace",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200076"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "NEW STORY ARC! EXORSISTERS returns for a second arc! In this issue, Cate finds herself in a world where her mother saved her instead of selling her soul, while Kate has taken over Hell as its new ruler. Has Cate lost her \"sister\" again?",
    "title": "EXORSISTERS #6 CVR B HICKEY",
    "price": "$3.99",
    "creators": "(W) Ian Boothby (A) Gisele Lagace, Pete Pantazis (CA) Brenda Hickey",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200077"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "When an eight-year-old girl begins to transform into a tree, her single Mom, troubled brother, and possibly insane grandfather embark on a bizarre and heart-wrenching odyssey across the back roads of America, desperately searching for a way to cure her horrifying transformation before it's too late.   Bestselling, award-winning writer JEFF LEMIRE (ROYAL CITY, DESCENDER, Sweet Tooth) and superstar artist PHIL HESTER (Shipwreck, Green Arrow) come together for FAMILY TREE, a genre-defying epic about the lengths a mother will go to keep her children safe in a world of unspeakable horrors.  Collects FAMILY TREE #1-4",
    "title": "FAMILY TREE TP VOL 01",
    "price": "$9.99",
    "creators": "(W) Jeff Lemire (A/CA) Phil Hester",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200094"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "END OF STORY ARC! Season three of FARMHAND comes to a cataclysmic conclusion. Jedidiah's greatest secret is revealed, and the Jenkins Family may not survive it.",
    "title": "FARMHAND #15 (MR)",
    "price": "$3.99",
    "creators": "(W) Rob Guillory (A/CA) Rob Guillory",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200264"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "The Woodsburgh Devil strikes again when another innocent victim falls into the clutches of the elusive killer. Meanwhile, Lady Hellaine invites the local bourgeoisie to a social event, attracting the attention of the powerful Lady Swanson. Subterfuge and lies emerge as the second chapter of MIRKA ANDOLFO's new project divulges a shocking revelation. ",
    "title": "MIRKA ANDOLFO MERCY #2 (OF 6) CVR A ANDOLFO (MR)",
    "price": "$3.99",
    "creators": "(W) Mirka Andolfo (A/CA) Mirka Andolfo",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200187"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "The Woodsburgh Devil strikes again when another innocent victim falls into the clutches of the elusive killer. Meanwhile, Lady Hellaine invites the local bourgeoisie to a social event, attracting the attention of the powerful Lady Swanson. Subterfuge and lies emerge as the second chapter of MIRKA ANDOLFO's new project divulges a shocking revelation. ",
    "title": "MIRKA ANDOLFO MERCY #2 (OF 6) CVR B BRAGA (MR)",
    "price": "$3.99",
    "creators": "(W) Mirka Andolfo (A) Mirka Andolfo (CA) Laura Braga",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200188"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "The Woodsburgh Devil strikes again when another innocent victim falls into the clutches of the elusive killer. Meanwhile, Lady Hellaine invites the local bourgeoisie to a social event, attracting the attention of the powerful Lady Swanson. Subterfuge and lies emerge as the second chapter of MIRKA ANDOLFO's new project divulges a shocking revelation. ",
    "title": "MIRKA ANDOLFO MERCY #2 (OF 6) CVR C SANDOVAL (MR)",
    "price": "$3.99",
    "creators": "(W) Mirka Andolfo (A) Mirka Andolfo (CA) Tony Sandoval",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200189"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "The space-faring crew of the Charon has faced death in all its many forms and fought all manner of creatures dark, diabolic, and demonic. Today, they face their deadliest threat yet. Yes, intrepid space travelers, murder has a name-and that name is POYO!",
    "title": "OUTER DARKNESS CHEW #2 (OF 3) CVR A CHAN (MR)",
    "price": "$3.99",
    "creators": "(W) John Layman (A) Rob Guillory (A/CA) Afu Chan",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200197"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "The space-faring crew of the Charon has faced death in all its many forms and fought all manner of creatures dark, diabolic, and demonic. Today, they face their deadliest threat yet. Yes, intrepid space travelers, murder has a name-and that name is POYO!",
    "title": "OUTER DARKNESS CHEW #2 (OF 3) CVR B GUILLORY (MR)",
    "price": "$3.99",
    "creators": "(W) John Layman (A) Rob Guillory (A/CA) Afu Chan",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200198"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "Welcome to Eden, Wyoming-a place founded by criminals, for criminals. A place where, despite its inhabitants, no crime is allowed. Through the eyes of local postman Mark Shiffron, we see a town struggling to keep its fragile peace, a town on the constant brink of chaos. Following the first murder in Eden's history, Mark's need to solve this crime leads him through the darkness to truth about the town he's known his entire life, and the hidden realms of his own psyche. After all, with his mother as the town's mayor and his mysterious father as its cofounder, Eden is his birthright. Co-writers BRYAN HILL and MATT HAWKINS team with artist ISAAC GOODHART for an unflinching tale about the price of redemption, told through the perspective of a young man with Asperberger's and set in the murky soul of America's heartland. Collects POSTAL #1-25, POSTAL: LAURA, POSTAL: MARK ",
    "title": "POSTAL COMP COLLECTION HC (MR)",
    "price": "$59.99",
    "creators": "(W) Bryan Hill, Matt Hawkins (A) Isaac Goodhart, Raffaele Ienco (CA) Linda Sejic",
    "release_date": "2020-05-27",
    "diamond_id": "OCT190117"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "DO NOT MISS THIS ISSUE!  Peter Parker's life will change... possibly forever. Rated T ",
    "title": "AMAZING SPIDER-MAN #43",
    "price": "$3.99",
    "creators": "(W) Nick Spencer (A/CA) Ryan Ottley",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200924"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "MOON KNIGHT VS. THE AVENGERS Mummies are rising from their graves. Secret armies march by moonlight, from K'un-Lun to Wakanda to Greenwich Village. A dark god invades Asgard. And the Moon Knight has been unleashed as never before. So begins the Age of Khonshu. So fall the Avengers. Rated T+ ",
    "title": "AVENGERS #33",
    "price": "$3.99",
    "creators": "(W) Jason Aaron (A) Javi Garron (CA) Matteo Scalera",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200982"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "A SHOW OF POWER! The Marauders set their sights on the power-dampening technology that seems to have made its way into far too many hands - most notably, the Russian Army. The Hellfire's wrath with be swift and harsh. Rated T+ ",
    "title": "MARAUDERS #10",
    "price": "$3.99",
    "creators": "(W) Gerry Duggan (A) Stefano Caselli (CA) Russell Dauterman",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200894"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "NEW CREW, NEW MISSION! With the Rebel Alliance back on the run after their defeat at the Battle of Hoth, it's never been a more dangerous time for outlaws, scoundrels and the errant rogue archaeologist to make their way in the galaxy. But after a string of bad luck and near escapes, DOCTOR APHRA is back on the job! She's been keeping a low profile - jobs are scarce and credits scarcer. But the promise of the score of a lifetime is a chance too good for her to pass up. And to find the cursed RINGS OF VAALE, Aphra will need a crew of treasure hunters the likes of which the galaxy has never seen before! But RONEN TAGGE, heir to the powerful Tagge family, also has his eyes on the prize. Do Aphra and her team stand a chance at fortune and glory? Rated T ",
    "title": "STAR WARS DOCTOR APHRA #1",
    "price": "$3.99",
    "creators": "(W) Alyssa Wong (A) Cresta, Marika (CA) Valentina Remenar",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201023"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A) Mark Bagley (CA) Ryan Stegman",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200939"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "",
    "title": "ALIENATED #3 (OF 6) FOC PEREZ VAR",
    "price": "$3.99",
    "creators": "(W) Simon Spurrier (A) Chris Wildgoose (CA) Ramon K. Perez",
    "release_date": "2020-05-27",
    "diamond_id": "FEB208188"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "Mal, Zo , and the rest of the ragtag crew of Serenity have been ambushed by bandits, kidnapped by zealots, pursued by bounty hunters, thrown in jail, broken out of jail, and thrown in jail again...but they'd go through it all again if it would mean staving off a second Unification War. In order to save the day, Mal will have to find allies in the most unexpected of places...and that starts with one of the most ruthless, terrifying people in the entire 'verse: his mother. Collects Firefly #9-12.",
    "title": "FIREFLY UNIFICATION WAR HC VOL 03",
    "price": "$19.99",
    "creators": "(W) Greg Pak (A) Dan McDaid (CA) Lee Garbett",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191254"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "Zack, and Trini are leaving Earth to officially join THE OMEGA RANGERS, but it means their former team is now down three people, with Lord Zedd about to launch his ultimate weapon! Zordon and Alpha-5 search desperately for worthy successors, but will it be enough to stop the enemy?",
    "title": "GO GO POWER RANGERS #31 CVR B MERCADO VAR",
    "price": "$3.99",
    "creators": "(W) Ryan Parrott, Sina Grace (A) Francesco Mortarino (CA) Miguel Mercado",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201284"
  },
  {
    "publisher": "BOOM! STUDIOS",
    "description": "",
    "title": "KING OF NOWHERE #2 (OF 5) CVR C FOC RUBIN VAR",
    "price": "$3.99",
    "creators": "(W) Maxwell Prince (A) Tyler Jenkins (CA) David Rubin",
    "release_date": "2020-05-27",
    "diamond_id": "JAN209130"
  },
  {
    "publisher": "DARK HORSE COMICS",
    "description": "A collection of over 200 pages of short comic stories expanding on the world of Disney Frozen! Brave the elements of ice and snow, and experience the magic of Frozen with Elsa, Anna, Kristoff, Sven, and Olaf in this graphic novel anthology! ",
    "title": "DISNEY FROZEN ADVENTURES TP ICE & MAGIC",
    "price": "$10.99",
    "creators": "(W) Alessandro Ferrari, Tea Orsi (A) Michela Frare, Emilio Urbano, Veronica Di Lorenzo, Marino Gentile",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200297"
  },
  {
    "publisher": "DC COMICS",
    "description": "Underwater fishticuffs! It's a battle royal as Orm's army, a bloodthirsty elemental,and Arthur go fin-to-fin-to-fin over the future of Atlantis's heir apparent. Alarm bells are ringing, and Mera better wake up soon, lest the kingdom come undone!",
    "title": "AQUAMAN #59 TYLER KIRKHAM VAR ED",
    "price": "$3.99",
    "creators": "(W) Kelly Sue DeConnick (A) Robson Rocha (CA) Tyler Kirkham",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200431"
  },
  {
    "publisher": "DC COMICS",
    "description": "It's time for a final swing of the axe. In the darkest, coldest hours of the night, June Branch finds herself up against the deadeyed killer who abducted her lover...and comes face to face with some truths even more horrifying than a basketful of heads.",
    "title": "BASKETFUL OF HEADS #7 (OF 7) GABRIEL RODRIGUEZ VAR ED (MR)",
    "price": "$3.99",
    "creators": "(W) Joe Hill (A) Leomacs (CA) Gabriel Rodriguez",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200511"
  },
  {
    "publisher": "DC COMICS",
    "description": "Batman goes over the edge! With everything that's happened in Gotham City and Ra's al Ghul's personal attacks on the Dark Knight and his team of Outsiders, Batman lashes out and uses his all his anger and skills to take down Ra's and his new League of Assassins on his own. Will the Outsiders be able to pull him back from his rage-or will they find themselves on the receiving end of it?",
    "title": "BATMAN AND THE OUTSIDERS #12 MICHAEL GOLDEN VAR ED",
    "price": "$3.99",
    "creators": "(W) Bryan Hill (A) Dexter Soy (CA) Michael Golden",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200435"
  },
  {
    "publisher": "DC COMICS",
    "description": "Terry McGinnis has his memories back, and he's ready to resume his duties as Batman in Neo-Gotham. But as soon as he comes home, so does Goliath, the Man-Bat pet of Damian Wayne. What adventure with the heir of the Demon lies in store for Batman Beyond?",
    "title": "BATMAN BEYOND #43 FRANCIS MANAPUL VAR ED",
    "price": "$3.99",
    "creators": "(W) Dan Jurgens (A) Sean Chen, Sean Parsons (CA) Francis Manapul",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200437"
  },
  {
    "publisher": "DC COMICS",
    "description": "In this \"Flash Age\" interlude, the Fastest Man Alive must find the Reverse-Flash to stop Paradox's annihilation of the Flash legacy. But catching a time-traveler is extremely difficult, and the Flash's quest to find Eobard Thawne takes him to tragic moments in time he never thought he'd have to revisit.",
    "title": "FLASH #753 JUNGEUON YOON VAR ED",
    "price": "$3.99",
    "creators": "(W) Joshua Williamson (A) Howard Porter (CA) Jung-Geun Yoon",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200446"
  },
  {
    "publisher": "DC COMICS",
    "description": "Acclaimed writer Mark Waid's run on The Flash continues with these adventures from the late 1990s. It's Wally West and Linda Park's wedding day-what could go wrong? Mysterious villain Cobalt Blue debuts with a surprising connection to Barry Allen! To stop him, it'll take a super-team of super speedsters, including Wally, Impulse, Jay Garrick, Jesse Quick, and Max Mercury in the epic story \"Chain Lightning\"! Collects The Flash #142-150, The Flash Secret Files #1, SpeedForce #1, The Life Story of the Flash graphic novel, and The Flash 80-Page Giant #1.",
    "title": "FLASH BY MARK WAID TP BOOK 07",
    "price": "$39.99",
    "creators": "(W) Mark Waid, Brian Augustyn (A) Paul Pelletier, Pop Mhan, Gil Kane, Joe Staton, Others (CA) Steve Lightle",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200555"
  },
  {
    "publisher": "DC COMICS",
    "description": "Grant Morrison and Liam Sharp continue their master class in comic book entertainment as Hal Jordan remains grounded on Earth by the Young Guardians. But when U.S. Air Force general \"Herc\" Stone reenlists \"Highball\" Jordan for a mission to locate his missing pilots, including Hal's ex Cowgirl, Jordan discovers an alien presence more dangerous than any stormy relationship!",
    "title": "GREEN LANTERN SEASON 2 #3 (OF 12) SCOTT WILLIAMS VAR ED",
    "price": "$3.99",
    "creators": "(W) Grant Morrison (A) Liam Sharp (CA) Scott Williams",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200452"
  },
  {
    "publisher": "DC COMICS",
    "description": "During the catastrophic events of Heroes in Crisis, Poison Ivy was killed, and Harley Quinn holds herself responsible. Butwhen Poison Ivy is resurrected, Harley decides to take care of her best friend, who has evolved into a creature as much flora as fauna. What, then, is Harley to do when Poison Ivy reveals she's had enough of the humans who not only killed her, but are destroying the environment day by day? Can Poison Ivy entice Harley to join her in the plant world, or will Harley have to prove herself by stopping whatever plot Ivy is cooking up? Collects Harley Quinn & Poison Ivy #1-6.",
    "title": "HARLEY QUINN & POISON IVY HC",
    "price": "$24.99",
    "creators": "(W) Jody Houser (A) Adriana Melo, Mark Morales (CA) Mikel Janin",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200562"
  },
  {
    "publisher": "DC COMICS",
    "description": "Cloaked in black and wearing the eerie mask of a hawk, the mysterious Plague Doctor roams 17th century Europe in an attempt to ease the suffering of those who fall victim to the Black Death. But how is the Doctor supposed to help anyone when he's hated and feared for his unique immunity to the disease? It's mind versus body as Carter Hall relives his most tragic past life in a last stand to fight off Sky Tyrant's control over his body for good!",
    "title": "HAWKMAN #23 GERARDO ZAFFINO VAR ED",
    "price": "$3.99",
    "creators": "(W) Robert Venditti (A) Marcio Takara, Fernando Pasarin (CA) Geraldo Zaffino",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200458"
  },
  {
    "publisher": "DC COMICS",
    "description": "DC BLACK LABEL AGES 17+ When murder is your art, it's not enough to leave behind a body-the only true satisfaction lies in creating a display worthy of your genius. But elaborate crime scenes also lend themselves to analysis. While the GCPD might not find all the clues, forensic psychiatrist and profiler Harley Quinn is getting closer to the truth...and the killer. 8.5\" x10.875\"",
    "title": "JOKER HARLEY CRIMINAL SANITY #4 (OF 9) MIKE MAYHEW VAR ED (M",
    "price": "$5.99",
    "creators": "(W) Kami Garcia (A) Jason Badower, Mico Suyan (CA) Mike Mayhew",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200461"
  },
  {
    "publisher": "DC COMICS",
    "description": "The Spirit of Vengeance goes global! After spending untold time in isolation, the Spectre is back, and his thirst for retribution will ripple across the Earth! As old wounds are reopened under the Spectre's unstoppable influence, it's up to the Justice League to stop the conflict. But how can they act on a global stage when they must first contend with their own resentments?",
    "title": "JUSTICE LEAGUE #45 DAN MORA VAR ED",
    "price": "$3.99",
    "creators": "(W) Robert Venditti (A) Eddy Barrows (CA) Dan Mora",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200465"
  },
  {
    "publisher": "DC COMICS",
    "description": "Octavia and El's search for their missing memories comes to a head when the terrible secrets of Shudder-to-Think, Pennsylvania's past are revealed at last.",
    "title": "LOW LOW WOODS #5 (OF 6) JENNY FRISON VAR ED (MR)",
    "price": "$3.99",
    "creators": "(W) Carmen Maria Machado (A) Dani (CA) Jenny Frison",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200517"
  },
  {
    "publisher": "DC COMICS",
    "description": "Meet Dewey Jenkins, a 13-year old schoolkid who's about to fail science class. Follow him on an amazing adventure that leads Dewey and his friends to a virtual world where they will have to overcome all sorts of digital creatures and solve a number of puzzles in order to get home. My Video Game Ate My Homework is a funny, fast-paced adventure that shows the importance of cooperation and teamwork, as well as the importance of using your own unique abilities to solve problems. It's illustrated in Dustin Hansen's colorful, cartoony style, and filled with lots of sight gags and nods to video-gaming tropes.  Dustin Hansen spent years directing and creating video games before becoming a writer and illustrator, and makes his DC debut with My Video Game Ate My Homework!  5\" x 8\"",
    "title": "MY VIDEO GAME ATE MY HOMEWORK TP",
    "price": "$9.99",
    "creators": "(W) Dustin Hansen (A/CA) Dustin Hansen",
    "release_date": "2020-05-27",
    "diamond_id": "JAN200516"
  },
  {
    "publisher": "DC COMICS",
    "description": "A riot erupts in the streets of Blu dhaven! While the new Nightwings do their best to contain the situation, Ric faces off against Talon-but the battle is one not just of brawn, as Ric's psyche is pushed to the limit when he learns about his family history all over again! Accepting his destiny as the Gray Son, Ric Grayson joins his great-grandfather as the newest Talon! Collects Nightwing #63-69 and Nightwing Annual #2.",
    "title": "NIGHTWING TP VOL 01 THE GRAY SON LEGACY",
    "price": "$19.99",
    "creators": "(W) Dan Jurgens (A) Ronan Cliquet (A/CA) Travis Moore",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200572"
  },
  {
    "publisher": "DC COMICS",
    "description": "Meet Courtney Whitmore, a typical teenage girl trying to make it through high school-but she's about to stumble upon a secret that will make her life a lot more complicated! Her new stepfather, Pat Dugan, was once a costumed adventurer called Stripesy. Finding the Kid's costume, Courtney decides to become the new Star-Spangled Kid! But Dugan isn't about to let his new daughter put herself in harm's way-at least, not by herself. He soon builds a robotic suit called S.T.R.I.P.E. so he can keep an eye on Courtney as she battles for justice. Now the duo fight side by side as they take on aliens, cults, super-villains, and more! Collects Stars and S.T.R.I.P.E. #0-14, JSA All Stars #4, and stories from DCU Heroes Secret Files (1999) and DCU Villains Secret Files (1999).",
    "title": "STARGIRL BY GEOFF JOHNS TP (RES)",
    "price": "$34.99",
    "creators": "(W) Geoff Johns, David S. Goyer (A) Lee Moder, Scott Kolins, Mike McKone, Chris Weston, Others (CA) Photo",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200575"
  },
  {
    "publisher": "DC COMICS",
    "description": "They say loose lips sink ships-and Captain Boomerang has the biggest mouth on Earth! That's why Lok commands Task Force X to bring him in andshut him up for good! The hunt is on, but nothing ever goes according to plan in the Suicide Squad-at least, not if Osita and her mutinous Revolutionaries can help it. Will Deathstroke and Harley finally turn against Lok when ordered to kill their old Squad-mate? One way or another, the bodies keep dropping...",
    "title": "SUICIDE SQUAD #5 JEREMY ROBERTS VAR ED",
    "price": "$3.99",
    "creators": "(W) Tom Taylor (A) Bruno Redondo (CA) Jeremy P. Roberts",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200490"
  },
  {
    "publisher": "DC COMICS",
    "description": "The terror organization Leviathan has transformed from a Batman menace to a global DC Universe threat, and Clark Kent is hot on their trail. But even Superman may be in for more than he bargained for as Leviathan undergoes a hostile takeover by a new, mysterious player. Someone has outmaneuvered the current leader, Talia al Ghul, along with the leaders of Kobra, the D.E.O. and even the queen of the spy game, Amanda Waller herself. All bets are off as the players make themselves known in the universe-changing Leviathan event! Collects Action Comics #1007-1011 and material from Superman: Leviathan Rising #1.",
    "title": "SUPERMAN ACTION COMICS TP VOL 02 LEVIATHAN RISING",
    "price": "$17.99",
    "creators": "(W) Brian Michael Bendis (A) Yanick Paquette (A/CA) Steve Epting",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200577"
  },
  {
    "publisher": "DC COMICS",
    "description": "His truth is revealed! After decades of leading a double life, the Man of Steel makes the monumental decision to reveal his secret identity to the world-leading to major repercussions in Metropolis and beyond. In a story that made international headlines, find out how the DC Universe react to discovering Superman and Clark Kent are one and the same. Plus, the Super Sons are reunited as Jonathan and Damian team for a new adventure-right before Jonathan has to decide if he'll travel a thousand years in the future and join the Legion of Super-Heroes. Collects Superman #16-19, Superman: Heroes #1, and Superman: Villains #1.",
    "title": "SUPERMAN HC VOL 03 THE TRUTH REVEALED",
    "price": "$24.99",
    "creators": "(W) Brian Michael Bendis, Matt Fraction, Jody Houser, Greg Rucka (A) Bryan Hitch, Kevin Maguire, Steve Lieber, Mike Perkins, Others (A/CA) Ivan Reis, Joe Prado",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200579"
  },
  {
    "publisher": "DC COMICS",
    "description": "At the gates of heaven itself, the Teen Titans must battle Djinn's older brother Elias with the fate of the world hanging in the balance! But victory comes at a terrible cost-because one of the Teen Titans won't be making it back!",
    "title": "TEEN TITANS #41 KHARY RANDOLPH VAR ED",
    "price": "$3.99",
    "creators": "(W) Adam Glass (A) Eduardo Pansica, Julio Ferreira (CA) Khary Randolph",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200498"
  },
  {
    "publisher": "DC COMICS",
    "description": "\"The Four Horsewomen\" part one! Paula Von Gunther, a.k.a. Warmaster, has assembled her four horsewomen...andnow she's out for Wonder Woman's blood! Plus, Diana is put on trial for the sins of the Amazons! Is it all just lies, or is there really a horrible secret the Amazons have kept from their own champion?",
    "title": "WONDER WOMAN #755",
    "price": "$3.99",
    "creators": "(W) Steve Orlando (A) Jesus Merino, Vicente Cifuentes (CA) Robson Rocha, Danny Miki",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200503"
  },
  {
    "publisher": "DC COMICS",
    "description": "\"The Four Horsewomen\" part one! Paula Von Gunther, a.k.a. Warmaster, has assembled her four horsewomen...andnow she's out for Wonder Woman's blood! Plus, Diana is put on trial for the sins of the Amazons! Is it all just lies, or is there really a horrible secret the Amazons have kept from their own champion?",
    "title": "WONDER WOMAN #755 IAN MACDONALD VAR ED",
    "price": "$3.99",
    "creators": "(W) Steve Orlando (A) Jesus Merino, Vicente Cifuentes (CA) Ian McDonald",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200504"
  },
  {
    "publisher": "IDW - TOP SHELF",
    "description": "Summer, 1994. With just two months left before college, Elodie is forced by her mother to take a job as a camp counselor. She doesn't know the first thing about nature, or sports, or kids for that matter, and isn't especially interested in learning... but now she's responsible for a foul-mouthed horde of girls who just might win her over. But just as Elodie starts getting used to her new environment-and close to one of the other counselors-a dark mystery lurking around the camp begins to haunt her dreams.",
    "title": "CAMP SPIRIT SC GN",
    "price": "$19.99",
    "creators": "(W) Axelle Lenoir (A) Axelle Lenoir (CA) Cab",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190722"
  },
  {
    "publisher": "IDW PUBLISHING",
    "description": "Join two of the most popular new characters from Sonic's world in this classic odd-couple team-up adventure! Tangle the Lemur's got a problem: there's not enough action in her life! Whisper the Wolf's also got a problem: she's hunting down an incredibly dangerous enemy named Sonic the Hedgehog! Can Tangle and Whisper help solve each other's problems, or will they just make things worse? Also collected is Sonic The Hedgehog: Annual 2019. Join Sonic and some of his coolest friends in adventures that show just how wonderful Sonic's world really is.",
    "title": "SONIC THE HEDGEHOG TANGLE & WHISPER TP VOL 01",
    "price": "$19.99",
    "creators": "(W) Ian Flynn, Various (A) Evan Stanley, Jack Lawrence, Diana Skelly, Jonathan Gray (A/CA) Jennifer Hernandez",
    "release_date": "2020-05-27",
    "diamond_id": "DEC190709"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "An Irish gangster on the run after a job gone wrong stumbles upon a young woman lost in the Dublin mountains. Injured and unarmed, the unlikely pair must try to evade their pursuers and survive the desolate bog that has served as a burial ground for unspeakable murder throughout history.  DECLAN SHALVEY (INJECTION, SAVAGE TOWN) and GAVIN FULLERTON (Bags) deliver a cold and poignant story of crime, survival, and regret.",
    "title": "BOG BODIES OGN (MR)",
    "price": "$12.99",
    "creators": "(W) Declan Shalvey (A) Gavin Fullerton, Nalty Rebecca (CA) Declan Shalvey",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200087"
  },
  {
    "publisher": "IMAGE COMICS",
    "description": "One phone call for help and all hell breaks loose for three strangers connected by bad luck, a twist of fate, and a gun in a puddle of rain. In the middle of a dense criminal underworld, these strangers' lives collide on one fateful and bloody night in this epic novelistic thriller by MATT FRACTION and ELSA CHARRETIER, with colors by MATT HOLLINGSWORTH and stunning hand-crafted lettering by cartoonist KURT ANKENY.  One night. One city. Three women. NOVEMBER.",
    "title": "NOVEMBER HC VOL 02 (O/A) (MR)",
    "price": "$16.99",
    "creators": "(W) Matt Fraction (A/CA) Elsa Charretier",
    "release_date": "2020-05-27",
    "diamond_id": "NOV190060"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "DO NOT MISS THIS ISSUE!  Peter Parker's life will change... possibly forever. Rated T ",
    "title": "AMAZING SPIDER-MAN #43 KEOWN MARVEL ZOMBIES VAR",
    "price": "$3.99",
    "creators": "(W) Nick Spencer (A) Ryan Ottley (CA) Dale Keown",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200925"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "MOON KNIGHT VS. THE AVENGERS Mummies are rising from their graves. Secret armies march by moonlight, from K'un-Lun to Wakanda to Greenwich Village. A dark god invades Asgard. And the Moon Knight has been unleashed as never before. So begins the Age of Khonshu. So fall the Avengers. Rated T+ ",
    "title": "AVENGERS #33 BENJAMIN MARVEL ZOMBIES VAR",
    "price": "$3.99",
    "creators": "(W) Jason Aaron (A) Javi Garron (CA) Ryan Benjamin",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200984"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "MOON KNIGHT VS. THE AVENGERS Mummies are rising from their graves. Secret armies march by moonlight, from K'un-Lun to Wakanda to Greenwich Village. A dark god invades Asgard. And the Moon Knight has been unleashed as never before. So begins the Age of Khonshu. So fall the Avengers. Rated T+ ",
    "title": "AVENGERS #33 PHAM SPIDER-WOMAN VAR",
    "price": "$3.99",
    "creators": "(W) Jason Aaron (A) Javi Garron (CA) Khoi Pham",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200983"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "NEW CREW, NEW MISSION! With the Rebel Alliance back on the run after their defeat at the Battle of Hoth, it's never been a more dangerous time for outlaws, scoundrels and the errant rogue archaeologist to make their way in the galaxy. But after a string of bad luck and near escapes, DOCTOR APHRA is back on the job! She's been keeping a low profile - jobs are scarce and credits scarcer. But the promise of the score of a lifetime is a chance too good for her to pass up. And to find the cursed RINGS OF VAALE, Aphra will need a crew of treasure hunters the likes of which the galaxy has never seen before! But RONEN TAGGE, heir to the powerful Tagge family, also has his eyes on the prize. Do Aphra and her team stand a chance at fortune and glory? Rated T ",
    "title": "STAR WARS DOCTOR APHRA #1 REMENAR VAR",
    "price": "$3.99",
    "creators": "(W) Alyssa Wong (A) Cresta, Marika (CA) Valentina Remenar",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201026"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25 BAGLEY VAR",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A/CA) Mark Bagley",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200942"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25 BLACK BLANK VAR",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A) Mark Bagley",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200947"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25 CHECCHETTO VAR",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A) Mark Bagley (CA) Marco Checchetto",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200945"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25 RAPOZA VAR",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A) Mark Bagley (CA) Dave Rapoza",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200944"
  },
  {
    "publisher": "MARVEL COMICS",
    "description": "SPECIAL OVERSIZED 25th ISSUE! VENOM ISLAND FINALE!  Caught between a Brock and a hard place! Eddie must make a life-altering decision. How does Eddie move on from the events of VENOM ISLAND? Rated T+ ",
    "title": "VENOM #25 RON LIM VAR",
    "price": "$5.99",
    "creators": "(W) Donny Cates (A) Mark Bagley (CA) Ron Lim",
    "release_date": "2020-05-27",
    "diamond_id": "FEB200941"
  },
  {
    "publisher": "AC COMICS",
    "description": "Teenage heroes in training get their trial-by-fire battling larcenous robots made out of classic cars! Agent hero Devilbones pursues the enigmatic vigilante adventuress, Tigerlily, while Claire's band of villains conspire to take down his boss, heroic mentor Tribune. Plus, what is the mysterious secret of Kid Victory?",
    "title": "21ST CENTURIONS #2",
    "price": "$5.95",
    "creators": "(W) Stephanie Heike (CA) Vic Bridges (A/CA) Mark G. Heike, Stephanie Heike",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191308"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Futaba Yoshioka has encountered her first love again in high school, but he seems different from the boy she once knew. Futaba starts dating Toma, and they kiss. Now what will happen when everyone is grouped together on a class trip to Nagasaki?  For teen audiences. ",
    "title": "AO HARU RIDE MANGA GN VOL 10",
    "price": "$9.99",
    "creators": "(W) Io Sakisaka (A/CA) Io Sakisaka",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202203"
  },
  {
    "publisher": "CONUNDRUM PRESS",
    "description": "Catherine Ocelot wonders about her place as an artist, digging into the layers of what it means to live this Art Life. In her search for answers, she talks with seven artists from different disciplines who express their doubts, their struggles, their ambitions and their sometimes-wise and sometimes-funny observations. The author stages these encounters with finesse and wit, and echoes them with scenes from her own life. Art Life is a tragicomic tale tinged with fantasy that explores the impact of others on oneself, led by an artist who slowly comes to understand herself.",
    "title": "ART LIFE GN",
    "price": "$20.00",
    "creators": "(W) Catherine Ocelot",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201687"
  },
  {
    "publisher": "KODANSHA COMICS",
    "description": "The saga of humanity and the predatory Titans edges closer to its thrilling conclusions. The mysteries of the Titans are being revealed; who will escape death at the hands of giants and human beings?",
    "title": "ATTACK ON TITAN GN VOL 30 (MR)",
    "price": "$10.99",
    "creators": "(W) Isayama Hajime (A/CA) Isayama Hajime",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202260"
  },
  {
    "publisher": "MAGNETIC PRESS INC.",
    "description": "Lost and alone, with little memory of how she wound up in the winter wilderness, young Yaya must survive the cold on her own while Tuduo sets out to find her before the wicked gangster Zhu does.",
    "title": "BALLAD OF YAYA GN VOL 06 LOST",
    "price": "$9.99",
    "creators": "(W) Patrick Marty, Jean-Marrie Omont, Charlotte Girard (A/CA) Golo Zhao",
    "release_date": "2020-05-27",
    "diamond_id": "MAR201969"
  },
  {
    "publisher": "LAURENCE KING PUBLISHING",
    "description": "Cool, talented, and transgressive, Jean-Michel Basquiat's life is just as fascinating as the work he produced. Delve into 1980s New York as this vivid graphic novel takes you on Basquiat's journey from street-art legend SAMO to international art-scene darling, up until his sudden death. Told through cinematic scenes, this is Basquiat as seen through the eyes of those who knew him. Basquiat is a moving depiction of a troubled artist's life for those interested in both the art and the man who made it.",
    "title": "BASQUIAT GN",
    "price": "$19.99",
    "creators": "(W) Paolo Parisi (A) Paolo Parisi",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201842"
  },
  {
    "publisher": "TOON BOOKS",
    "description": "When her sister, Clemmie, refuses to play in the rain, Matilda wants to teach her the delights of a wet Satirday. They end up learning an unforgettable lesson. A Toon Level 2 book.",
    "title": "BIG WET BALLOON SC",
    "price": "$6.99",
    "creators": "(W) Ricardo Liniers (A/CA) Ricardo Liniers",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202045"
  },
  {
    "publisher": "GRAPHIX",
    "description": "Synopsis: Squirrel helps Bird overcome his biggest challenge yet -- FAMILY!  The dangerous Horned Toad 500 cross-country race is coming up and Bird's father has always won it. But when his dad gets injured, Bird reluctantly joins the race to save the family honor. While dealing with the scorching desert heat and dirty tricks from another team, Bird and Squirrel are put to the ultimate test of endurance and sportsmanship. Along the way, the duo learns that, win or lose, having good friends and family will always get you to the finish line.",
    "title": "BIRD & SQUIRREL GN HC VOL 06 ALL OR NOTHING",
    "price": "$18.99",
    "creators": "(W) James Burks (A/CA) James Burks",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201794"
  },
  {
    "publisher": "GRAPHIX",
    "description": "The dangerous Horned Toad 500 cross-country race is coming up and Bird's father has always won it. But when his dad gets injured, Bird reluctantly joins the race to save the family honor. While dealing with the scorching desert heat and dirty tricks from another team, Bird and Squirrel are put to the ultimate test of endurance and sportsmanship. Along the way, the duo learns that, win or lose, having good friends and family will always get you to the finish line. Available in softcover and hardcover editions.",
    "title": "BIRD & SQUIRREL GN VOL 06 ALL OR NOTHING",
    "price": "$9.99",
    "creators": "(W) James Burks (A/CA) James Burks",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201793"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "For some reason, Taichi Ichinose just can't stand Futaba Kuze. But at the start of his third year in high school, he finds himself in the same homeroom as her, along with his childhood friend Toma Mita, a star athlete. But one day, Futaba opens up to Taichi and admits she has a crush on Toma. She then asks for his help in confessing to him! There's just one problem-Toma seems to already have a secret crush on someone else.  For older teen audiences. ",
    "title": "BLUE FLAG GN VOL 01",
    "price": "$12.99",
    "creators": "(W) Kaito (A/CA) Kaito",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202201"
  },
  {
    "publisher": "KODANSHA COMICS",
    "description": "On the fair island campus of Dahlia, the student body is split into two rival dorms: The Black Dog House of the eastern nation of Touwa, and the White Cats House of the West. Despite his doting childhood friend and a loyal posse, the first-year leader of the Black Dogs, Romeo Inuzuka, has one big teenage problem: He has a crush on Juliet Persia, the first-year leader of the White Cats! With her own brainiac right-hand man and a powerful crew behind her, the cutthroat Juliet thinks she has no time for misadventures with a hopeless romantic like Romeo. When Romeo meets Juliet one fateful twilight, he thinks he has a shot at love... but is this secret affair really worth dying for?",
    "title": "BOARDING SCHOOL JULIET GN VOL 11",
    "price": "$10.99",
    "creators": "(W) Yousuke Kaneda (A/CA) Yousuke Kaneda",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202262"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Though burdened by a traumatic past, Kawaki slowly begins to open up to Boruto and his friends. However, the members of Kara soon infiltrate Konoha village in order to bring him back. Can Naruto and Boruto protect Kawaki from these powerful enemies?!  For teen audiences. ",
    "title": "BORUTO GN VOL 08 NARUTO NEXT GENERATIONS",
    "price": "$9.99",
    "creators": "(W) Masashi Kishimoto, Ukyo Kodachi (A/CA) Mikio Ikemoto",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202191"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "Sergeants Perky, Rats and Botasky, the members of special forces Cat Shit One, continue to brave their way through multiple dangerous missions on the battlefields of Vietnam.The stars of Motofumi Kobayashi's famous war manga may be \"mere\" rabbits on the outside, but they're beasts of battle through and through!",
    "title": "CAT SHIT VOL 01 #2 (OF 3)",
    "price": "$3.99",
    "creators": "(W) Motofumi Kobayashi (A) Motofumi Kobayashi",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191410"
  },
  {
    "publisher": "SQUARE FISH",
    "description": "Here is an irresistible collection of clever cat-themed cartoons, a companion title to Dave Coverly's Dogs Are People, Too: A Collection of Cartoons to Make Your Tail Wag. This collection contains over a hundred of Dave's funniest cat cartoons from his nationally syndicated panel Speed Bump, as well as cat doodles and interviews from eight other award-winning cat-loving cartoonists. Filled with cat clich&#233;s, cat bloopers, and pop \"cature,\" this is a compelling gift item perfect for animal-lovers of all ages.",
    "title": "CATS ARE PEOPLE TOO COLL CAT CARTOONS SC",
    "price": "$16.99",
    "creators": "(W) Dave Coverly (A) Dave Coverly",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201992"
  },
  {
    "publisher": "GRAPHIX",
    "description": "Catwad, the snarky blue furball with a funny take on just about everything, is back in this third graphic novel in an all-new series from New York Times-bestselling author Jim Benton! Catwad and Blurmp are back and ready for more adventures in this newest volume in which they meet new friends, try out yoga (spoiler alert: Catwad hates it), and more! It's a laugh-out-loud romp not to be missed, even if Catwad claims otherwise.",
    "title": "CATWAD GN VOL 03 ME THREE",
    "price": "$8.99",
    "creators": "(W) Jim Benton (A/CA) Jim Benton",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201795"
  },
  {
    "publisher": "DEAD RECKONING",
    "description": "Sir Winston Churchill, often referred to as the greatest Briton, is certainly one of the most important and central figures of the 20th Century. This graphic biography takes the reader from Churchill's upbringing, through his military exploits and his experience of the First World War. Best known for his role in the Second World War, this biography presents Churchill's part in this conflict in a detailed yet inventive manner, making this huge event accessible for people of all ages and knowledge.",
    "title": "CHURCHILL GRAPHIC BIOGRAPHY GN",
    "price": "$19.95",
    "creators": "(W) Vincent Delmas (A) Christophe Regnault, Alessio Cammardella",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201690"
  },
  {
    "publisher": "ARCHIE COMIC PUBLICATIONS",
    "description": "The Martian crew has been captured by the Venusian Queen Hesper and her Battle Princesses! Cosmo is faced with a difficult choice when Hesper offers him a position of power as her loyal King in exchange for the release of his friends! Will Cosmo prove himself to be the mightiest Martian?! The confrontation on Venus ends here!",
    "title": "COSMO MIGHTY MARTIAN #5 (OF 5) CVR A YARDLEY",
    "price": "$3.99",
    "creators": "(W) Ian Flynn (A/CA) Tracy Yardley",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201505"
  },
  {
    "publisher": "ARCHIE COMIC PUBLICATIONS",
    "description": "The Martian crew has been captured by the Venusian Queen Hesper and her Battle Princesses! Cosmo is faced with a difficult choice when Hesper offers him a position of power as her loyal King in exchange for the release of his friends! Will Cosmo prove himself to be the mightiest Martian?! The confrontation on Venus ends here!",
    "title": "COSMO MIGHTY MARTIAN #5 (OF 5) CVR B CABRERA",
    "price": "$3.99",
    "creators": "(W) Ian Flynn (A) Tracy Yardley (CA) Eva Cabrera",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201506"
  },
  {
    "publisher": "ARCHIE COMIC PUBLICATIONS",
    "description": "The Martian crew has been captured by the Venusian Queen Hesper and her Battle Princesses! Cosmo is faced with a difficult choice when Hesper offers him a position of power as her loyal King in exchange for the release of his friends! Will Cosmo prove himself to be the mightiest Martian?! The confrontation on Venus ends here!",
    "title": "COSMO MIGHTY MARTIAN #5 (OF 5) CVR C HERMS",
    "price": "$3.99",
    "creators": "(W) Ian Flynn (A) Tracy Yardley (CA) Matt Herms",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201507"
  },
  {
    "publisher": "DIAL BOOKS",
    "description": "Part poignant cancer memoir and part humorous reflection on a motherless life, this debut graphic novel is extraordinarily comforting and engaging. From before her mother's first oncology appointment through the stages of her cancer to the funeral, sitting shiva, and afterward, when she must try to make sense of her life as a motherless daughter, Tyler Feder tells her story in this graphic novel that is full of piercing, but also often funny, details. This memoir, bracingly candid and sweetly humorous, is for anyone struggling with loss who just wants someone to get it.",
    "title": "DANCING AT THE PITY PARTY GN",
    "price": "$18.99",
    "creators": "(W) Tyler Feder (A) Tyler Feder",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201696"
  },
  {
    "publisher": "AFTERSHOCK COMICS",
    "description": "If the dead could come back for just one night, would we want them to?   Meet the Haskins, a seemingly normal suburban family, as they prepare for the annual macabre holiday known as \"Dead Day\" - when the deceased rise from the grave from sunset to sunrise. Some come back to reunite with family and friends, others for one last night of debauchery, still others with only one thing on their decomposing mind: revenge.  From writer Ryan Parrott (OBERON, VOLITION, Power Rangers) and artist Evgeniy Bornyakov (DESCENDENT, YOU ARE OBSOLETE) comes an unnerving tale of exis-tential horror with grave consequences. ",
    "title": "DEAD DAY #1 CVR A CLARKE",
    "price": "$4.99",
    "creators": "(W) Ryan Parrott (A) Evgeny Bornyakov (CA) Andy Clarke",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201403"
  },
  {
    "publisher": "AFTERSHOCK COMICS",
    "description": "In 2011, the worst earthquake in Japan's history (and the catastrophic tsunami that followed) breached the costal Fukushima Daiichi power plant, causing three of its four nuclear reactors to melt down. Forced evacuations followed as the event released enough radioactive material into the air, ground and water to force officials to set up an \"Exclusion Zone\" for only the second time in history after the Chernobyl disaster, effectively sealing off the land for what may well be the rest of human history. But that's only if you don't have the right connections, the right people to pull the strings, and the desire to experience catastrophe, failure and misery as it really is! Enter DISASTER INC., an underground tourism outfit intent on helping people of means, secrets and agendas explore the dark corners and off-map attractions typical tour groups won't go to (and various laws don't al-low). Only Fukushima, known for its famed warrior class and their protection of the land and people dating back to ancient times, is full of deadly surprises and old ghosts.  Writer Joe Harris (Great Pacific, Rockstars, The X-Files) and artist Sebasti&#225;n Piriz begin a disas-ter tour checking out the worst places on earth while digging up more trouble than they can prob-ably handle. Then, in a world on fire and rife with calamity, catastrophe, war and unrest... you're going to need the right guides to see it for yourself!",
    "title": "DISASTER INC #1 CVR A CLARKE",
    "price": "$4.99",
    "creators": "(W) Joe Harris (A) Sebastian Piriz (CA) Andy Clarke",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201401"
  },
  {
    "publisher": "FANTAGRAPHICS BOOKS",
    "description": "Riding from Duckburg to Montreal on a luxury train full of celebrities, railroad porter Donald Duck can't wait to serve breakfast to his daring action-movie idol - Sharon Stun. But Donald and his nephews get caught up in a real-life thriller - when \"Mystic\" Max McMalefactor, disguise artist and sinister spy, infiltrates the Epoch Express with plans for plunder! But \"Scandal on the Epoch Express\" is just the start! In \"Scent-imental Romeos,\" Donald vows to create the world's stinkiest cologne. And in \"Don Quiduck De La Mancha,\" a hypnotized Donald thinks he's a knight - and helps the Beagle Boys rob Uncle Scrooge's Money Bin! Each volume of our Disney Masters series presents acclaimed artists from around the world working in the grand Walt Disney tradition.",
    "title": "DISNEY MASTERS HC VOL 10 HEYMANS DUCK SCANDAL EPOCH EXPRESS",
    "price": "$29.99",
    "creators": "(W) Mau Heymans, Bas Heymans (A/CA) Mau Heymans, Bas Heymans",
    "release_date": "2020-05-27",
    "diamond_id": "JAN198694"
  },
  {
    "publisher": "KODANSHA COMICS",
    "description": "A young boy gazes up at the sky and sees a streaming bolt of light. The friendly, armor-clad being at his side tells him gently, \"That's a dragon.\" The fact that he's joking isn't important. What's important is the look of wonder on the boy's face... and the galaxy-spanning adventure that's about to take place! Join Hiro Mashima (Fairy Tail, Rave Master) once more as he takes to the stars for another thrilling saga!",
    "title": "EDENS ZERO GN VOL 07",
    "price": "$10.99",
    "creators": "(W) Hiro Mashima (A/CA) Hiro Mashima",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202265"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "32 action-packed pages in this 75th legacy issue of Exciting Comics! The thrilling adventures of the legendary Black Terror continue. Crimebuster 76 recruits her super squad's final member, Lady Godiva. The Crimson Scorpion comes face to face with... Cat-Man?! All this and more!",
    "title": "EXCITING COMICS #6 CVR A OLESCO",
    "price": "$3.99",
    "creators": "(W) Various (A) Various (CA) Joseph Olesco",
    "release_date": "2020-05-27",
    "diamond_id": "OCT191586"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "The thrilling adventures of the legendary Black Terror continue. Crimebuster 76 recruits her super squad's final member, Lady Godiva.We wrap up the gut-wrenching saga of Black Jaq, and the Crimson Scorpion comes face to face with the Emperor Scorpion in his own dramatic conclusion!  This may only be the sixth issue from A.P., but combined with its original run, this makes a grande total of 75 exciting issues of Exciting!We're celebrating in grand style with a cavalcade of courageous characters cleverly composed by comic book celebrity Brian Denham!",
    "title": "EXCITING COMICS #6 CVR B LEGACY VAR",
    "price": "$4.99",
    "creators": "(W) Various (A) Various (CA) Brian Denham",
    "release_date": "2020-05-27",
    "diamond_id": "OCT191587"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "The thrilling adventures of the legendary Black Terror continue. Crimebuster 76 recruits her super squad's final member, Lady Godiva.We wrap up the gut-wrenching saga of Black Jaq, and the Crimson Scorpion comes face to face with the Emperor Scorpion in his own dramatic conclusion! Crimebuster 76 has assembled a squad to combat super-powered threats.Check out the latest recruit, the mighty Lady Godiva, but don't stare too long-she just might steal your soul.",
    "title": "EXCITING COMICS #6 CVR C LADY GODIVA VAR",
    "price": "$9.99",
    "creators": "(W) Various (A) Various (CA) Brian Denham",
    "release_date": "2020-05-27",
    "diamond_id": "OCT191588"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "The Blue cooking competition rages on! Intent on getting his rematch with Asahi Saiba, Soma keeps racking up win after win, even against his formidable noir opponents. Meanwhile, in the other tournament bracket, Erina faces a suspiciously heinous schedule. What exactly is the book master planning?!  For older teen audiences. ",
    "title": "FOOD WARS SHOKUGEKI NO SOMA GN VOL 35",
    "price": "$9.99",
    "creators": "(W) Yuto Tsukuda, Yuki Morisaki (A/CA) Shun Saeki",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202199"
  },
  {
    "publisher": "SEVEN SEAS ENTERTAINMENT LLC",
    "description": "A time-freezing yuri love story between two high school girls, now with an anime! Moritani Misuzu has a unique power: for three minutes each day, she can stop time. Her life changes when she uses that same power to peek at a beautiful classmate's underwear. To Moritani's surprise, this classmate, Murakami Haruka, is immune to Moritani's time-freezing technique. Bound together by their odd powers, the two girls begin to grow closer... and find that it's more than their strange abilities attracting them to each other.",
    "title": "FRAGTIME OMNIBUS GN (MR)",
    "price": "$18.99",
    "creators": "(W) Sato (A/CA) Sato",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202311"
  },
  {
    "publisher": "ONI PRESS INC.",
    "description": "The Devastorm 5 is an alien warship whose prime directive is to seek out planets to invade and conquer in tribute to the almighty Alien Queen. The only problem is that the crew of the Devastorm 5 is the worst in the fleet. In a last ditch effort to be taken more seriously, the Devastrom 5 crew vows to conquer Earth once and for all. Ground zero for operation \"Conquer Earth\" is a defunct amusement park called Fun Fun Fun World, overrun by cats and hiding a major secret. Will the crew of the Devastorm 5 be able to complete their mission?",
    "title": "FUN FUN FUN WORLD SC GN",
    "price": "$12.99",
    "creators": "(W) Yehudi Mercado (A) Yehudi Mercado",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191798"
  },
  {
    "publisher": "SEVEN SEAS ENTERTAINMENT LLC",
    "description": "High school student Takahara Yachiho has just moved into a notoriously haunted house on the outskirts of town. With only her cat Fuku-chan for company, Yachiho is disturbed by strange sounds and happenings... until the day she comes across a small passage leading to a hidden lower floor. There she discovers spirits of all shapes and sizes, guided by the tiny supernatural \"manager\" Moro. If Yachiho is to call this place home, she'll have to deal with its ghostly denizens - and find a mysterious book that may be the key to locating her missing mother.",
    "title": "GHOSTLY THINGS GN VOL 02",
    "price": "$12.99",
    "creators": "(W) Ushio Shirotori (A/CA) Ushio Shirotori",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202312"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "Having arrived on what appears to be Earth, now bereft of any human life, Gina treks to the Library of Time in hopes that she can discover what happened in her absence. There she finds a book, a role-playing game module that dictates her every move... and the moves of the beast which now stalks her in the library ruins!",
    "title": "GOLD DIGGER #272",
    "price": "$3.99",
    "creators": "(W) Fred Perry (A) Fred Perry",
    "release_date": "2020-05-27",
    "diamond_id": "OCT191578"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "After the chaos at Abashiri prison, Asirpa, Shiraishi and Kiroanke head for Karafuto, unaware that Kiroranke has betrayed them for his own goals. The untamed island of Karafuto is even further north than Hokkaido, and home to both Japanese and Russian settlements. Asirpa is also now the only person who can decipher the map on the tattooed skins. Sugimoto, wounded and captured by the 7th Division after the battle, makes a deal with Tsurumi to go along. The search for the Ainu gold moves to a harsh new environment!  For mature audiences. ",
    "title": "GOLDEN KAMUY GN VOL 15 (MR)",
    "price": "$12.99",
    "creators": "(W) Satoru Noda (A/CA) Satoru Noda",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202210"
  },
  {
    "publisher": "SEVEN SEAS ENTERTAINMENT LLC",
    "description": "In this beautiful new yuri manga, a young British noblewoman asks her maid to kill her... but the two fall in love instead! England, the early 1900s. Alice, a young noblewoman, has a Japanese maid named Hanako working in her household. The two have a fairly typical relationship... until the day Alice begs Hanako to kill her. As Hanako tries to figure out why her mistress would make such a terrible request, she and Alice grow closer until an entirely new feeling begins to blossom between them. Don't miss this poignant tale about women falling in love in historical Britain.",
    "title": "GOODBYE MY ROSE GARDEN GN VOL 01 (MR)",
    "price": "$12.99",
    "creators": "(W) Dr.Pepperco (A/CA) Dr.Pepperco",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202313"
  },
  {
    "publisher": "ZUIKER PRESS",
    "description": "Hailee was an A student, bubbling with enthusiasm and love for life. She danced, wrote poems, and attended classes for gifted students. She loved playing with her little brother, Jacob. When she was twelve years old, the bullying began. First it was a boy in math class who seemed to have a crush on her. Then it was a girl in P.E. who would crash into her when no one was looking. Hailee tried to avoid the bullies. She made excuses to her parents in order to escape. They didn't know that her life was becoming unbearable. In seventh grade, the bullying increased, growing like a cancer. Hailee kept up appearances to protect her parents and brother, but inside she was suffering. Two days after her thirteenth birthday, she succumbed to the pain. Hailee's parents have decided to not allow her death to be in vain. Their hope is that by sharing Hailee's story, they may prevent another young person from making a fatal choice.",
    "title": "GOODBYE STORY OF SUICIDE GN",
    "price": "$12.99",
    "creators": "(W) Hailee Joy Lamberth (A) Don Hudson",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202109"
  },
  {
    "publisher": "KODANSHA COMICS",
    "description": "Ever since his father ran off in search of the mystical island in the sky, Estalucia, Gran has lived alone. Until one day, a girl named Lyria makes a daring escape from the army, ending in an airship falling off a cliff, and squashing Gran! When he comes to, he's back in one piece, but he's forced to join Lyria on the run. The entire world seems to be after the mysterious powers she used to revive him! ",
    "title": "GRANBLUE FANTASY GN VOL 04",
    "price": "$12.99",
    "creators": "(W) Cygames (A/CA) Cocho",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202268"
  },
  {
    "publisher": "AARDVARK VANAHEIM",
    "description": "First Team Up of Green Dante and Green Virgil, proving or disproving, once again, Stan Lee's axiom that \"Green Covers Don't Sell!\" Meet! The David Ben-Gurions of the Galaxy! See! The snazzy Poet Power Ring they give Green Dante! Wonder! If this is an enactment of Beneath the Planet of the Of The Philistines or BAttle For the Planet of the Philistines or what? Meanwhile! Green Virgil's ward, Cerebus is rocking a major Twitter Jones, hooked by the \"Free Legal Advice\" Twitter feed. Can he find a way to buy his rights back? ",
    "title": "GREEN DANTE GREEN VIRGIL ONE SHOT",
    "price": "$4.00",
    "creators": "(W) Dave Sim (A) Gustave Dore (A/CA) Dave Sim",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201341"
  },
  {
    "publisher": "ZENESCOPE ENTERTAINMENT INC",
    "description": "Truths will be revealed as Skye comes face-to-face with her most powerful enemy! Does the Guardian of the Nexus stand a chance or will she fall under the power of Merlin and the Knights of the Roundtable? Find out here in the penultimate issue to the Odyssey story arc!",
    "title": "GRIMM FAIRY TALES #37 CVR A VITORINO",
    "price": "$3.99",
    "creators": "(W) Dave Franchini (CA) Igor Vitorino",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191992"
  },
  {
    "publisher": "ZENESCOPE ENTERTAINMENT INC",
    "description": "Truths will be revealed as Skye comes face-to-face with her most powerful enemy! Does the Guardian of the Nexus stand a chance or will she fall under the power of Merlin and the Knights of the Roundtable? Find out here in the penultimate issue to the Odyssey story arc!",
    "title": "GRIMM FAIRY TALES #37 CVR B WHITE",
    "price": "$3.99",
    "creators": "(W) Dave Franchini (CA) Caanan White",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191993"
  },
  {
    "publisher": "ZENESCOPE ENTERTAINMENT INC",
    "description": "Truths will be revealed as Skye comes face-to-face with her most powerful enemy! Does the Guardian of the Nexus stand a chance or will she fall under the power of Merlin and the Knights of the Roundtable? Find out here in the penultimate issue to the Odyssey story arc!",
    "title": "GRIMM FAIRY TALES #37 CVR C ZALDIVAR",
    "price": "$3.99",
    "creators": "(W) Dave Franchini (CA) Hedwin Zaldivar",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191994"
  },
  {
    "publisher": "ZENESCOPE ENTERTAINMENT INC",
    "description": "Truths will be revealed as Skye comes face-to-face with her most powerful enemy! Does the Guardian of the Nexus stand a chance or will she fall under the power of Merlin and the Knights of the Roundtable? Find out here in the penultimate issue to the Odyssey story arc!",
    "title": "GRIMM FAIRY TALES #37 CVR D VIGONTE",
    "price": "$3.99",
    "creators": "(W) Dave Franchini (CA) Geebo Vigonte",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191995"
  },
  {
    "publisher": "KODANSHA COMICS",
    "description": "Arslan is the teenaged prince of the ancient kingdom of Pars who doesn't seem to have what it takes to be a great ruler like his father, Andragoras III. A fateful encounter with a slave from the neighboring country of Lusitania leads Arslan to question the world outside of the royal capital's walls but before he can indulge his curiosity, war breaks out. Arslan is rushed off to his first war, only to see his kingdom crumble in front of his eyes. This series of events leads the young Arslan on a journey to reclaim his lost kingdom.",
    "title": "HEROIC LEGEND OF ARSLAN GN VOL 12",
    "price": "$10.99",
    "creators": "(W) Yoshiki Tanaka (A/CA) Hiromu Arakawa",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202270"
  },
  {
    "publisher": "FANTAGRAPHICS BOOKS",
    "description": "For years, cartoonist B.K. Taylor regaled the readers of National Lampoon with the goofiness of \"Timberland Tales\" and \"The Appletons.\" Now Fantagraphics brings you a complete collection of Taylor's creations, showcasing all of \"The Appletons,\" \"Timberland Tales,\" plus more, including a foreword by Tim Allen and afterword by R.L. Stine.",
    "title": "I THINK HES CRAZY HC NATIONAL LAMPOON",
    "price": "$22.99",
    "creators": "(W) B. K. Taylor",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201772"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "The mean Dark Lord has turned into a kindly knight! It's like a dream come true! Is this really happening?!!  Nanase became a nurse to chase after Dr. Kairi Tendo. To keep herself safe from a former patient who is stalking her, she stays with Kairi and pretends to be his lover! But the stalker becomes furious and attacks! As she loses consciousness, she reveals to Kairi how she feels!  For mature audiences. ",
    "title": "INCURABLE CASE OF LOVE GN VOL 03 (MR)",
    "price": "$9.99",
    "creators": "(W) Maki Enjoji (A/CA) Maki Enjoji",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202202"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Tensions are high as the Goodwill Event between the Tokyo and Kyoto campuses of Jujutsu High approaches. But before the competition can even begin, a couple of Kyoto students confront Fushiguro and Kugisaki. Meanwhile, Yuji's training gets interrupted by a mysterious crime involving grotesque bodily alterations caused by a cursed spirit...  For older teen audiences. ",
    "title": "JUJUTSU KAISEN GN VOL 03",
    "price": "$9.99",
    "creators": "(W) Gege Akutami (A/CA) Gege Akutami",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202196"
  },
  {
    "publisher": "REBELLION / 2000AD",
    "description": "Lord Of The Rings meets Independence Day in this brand-new fantasy epic. The inhabitants of the Nine Kingdoms fought hard to liberate their world from the tyranny of Ichnar the Wraith King. Little did they suspect that a greater threat would soon fall upon them in the form of the Thorn, a race of aliens intent on strip-mining all of the magic from the world. Now old enemies have formed an alliance; Wizard Ablard, ork Crixus and the dryad Princess Yarrow have set aside their differences and are seeking to use the Ebora world spirit against the invaders.",
    "title": "KINGMAKER TP VOL 01",
    "price": "$19.99",
    "creators": "",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201947"
  },
  {
    "publisher": "HUMANOIDS INC",
    "description": "A visiting nurse takes on a patient with Alzheimer's and is invited into her strange, beautiful and often unseen world.  At times, caring for Josephine is like caring for an infant-other times, like being cared for by a grandmother. As Josephine slips further and further into the fog, her caretaker, Valerie, reflects on her own life and what it means to be someone's keeper. ",
    "title": "LITTLE JOSEPHINE TP MEMORY IN PIECES",
    "price": "$17.99",
    "creators": "(W) Valerie Villieu (A) Raphael Sarfati",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201812"
  },
  {
    "publisher": "SQUARE ENIX MANGA",
    "description": "Traumatized by a childhood incident with a friend who took exception to his love of traditional dolls, doll-artisan hopeful Wakana Gojou passes his days as a loner, finding solace in the home ec room at his high school. To Wakana, people like beautiful Marin Kitagawa, a trendy girl who's always surrounded by a throng of friends, is practically an alien from another world. But when cheerful Marin, never one to be shy, spots Wakana sewing away one day after school, she barges in with the aim of roping her quiet classmante into her secret hobby: cosplay! Will Wakana's wounded heart be able to handle the invasion from this sexy alien?",
    "title": "MY DRESS UP DARLING GN VOL 01",
    "price": "$12.99",
    "creators": "(W) Shinichi Fukuda (A) Shinichi Fukuda",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202305"
  },
  {
    "publisher": "GRAPHIX",
    "description": "Making friends isn't easy, but losing them is even harder! Natalie has never felt that she's enough. Athletic enough, stylish enough, or talented enough. And on the first day of middle school, Natalie discovers that things are worse than she thought; now she's not even cool enough for her best friend, Lily! As Natalie tries to get her best friend back, she learns more about her true self and natural talents. If Natalie can focus on who she is rather than who she isn't, then she might realize she's more than enough, just the way she is. Available in softcover and hardcover editions.",
    "title": "NAT ENOUGH GN  VOL 01",
    "price": "$12.99",
    "creators": "(W) Maria Scrivan (A) Maria Scrivan",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201796"
  },
  {
    "publisher": "GRAPHIX",
    "description": "Synopsis: Making friends isn't easy, but losing them is even harder!  Natalie has never felt that she's enough -- athletic enough, stylish enough, or talented enough. And on the first day of middle school, Natalie discovers that things are worse than she thought -- now she's not even cool enough for her best friend, Lily! As Natalie tries to get her best friend back, she learns more about her true self and natural talents. If Natalie can focus on who she is rather than who she isn't, then she might realize she's more than enough, just the way she is.",
    "title": "NAT ENOUGH HC GN",
    "price": "$24.99",
    "creators": "(W) Maria Scrivan (A) Maria Scrivan",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201797"
  },
  {
    "publisher": "ARCHIE COMIC PUBLICATIONS",
    "description": "Take a trip back in time to Riverdale Middle School with The New Archies! Archie, Betty, Veronica and the whole gang were just as goofy then as they are now as high school students! Can Ms. Grundy keep her class under control? Revisit these fun tales in this graphic novel collection featuring select stories.",
    "title": "NEW ARCHIES TP",
    "price": "$10.99",
    "creators": "(W) Various (A) Various (CA) Henry Scarpelli",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201513"
  },
  {
    "publisher": "ONE PEACE BOOKS",
    "description": "THE NEW GATE-an online game transformed into a life-and-death struggle for its players. Thanks to the valiant efforts of Shin, the most powerful of them all, an end to the game and freedom for everyone seemed within reach. But just moments after Shin defeats the game's final boss, he finds himself bathed in an unknown light and transported some 500 years into the future of the in-game world. Thrown from a simple game-gone-wrong into a strange new land, one young swordsman of unrivalled strength is about to embark on a legendary journey!",
    "title": "NEW GATE MANGA GN VOL 01",
    "price": "$11.95",
    "creators": "(W) Yoshiyuki Miwa (A/CA) Yoshiyuki Miwa",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202279"
  },
  {
    "publisher": "FLOATING WORLD COMICS",
    "description": "Not a Place to Visit is a new collection of illustrated essays by Wild Man cartoonist T Edward Bak. Exploring themes of social and ecological flux unique to environments in the western US through concisely rendered reflections this series examines the migration of the artist's family to and from Colorado's San Luis Valley, tourism and salmon on the Columbia River, the fraught ecosystem of southern California's Salton Sea, and fracking along the northern Colorado prairie and Front Range. ",
    "title": "NOT A PLACE TO VISIT GN",
    "price": "$12.00",
    "creators": "(W) T. Edward Bak (A) T. Edward Bak",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201774"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Robin infiltrates the Shogun's palace in order to collect valuable intelligence, but she's quickly spotted by Orochi's henchmen. Can she be ninja-like and make a stealthy escape? Meanwhile, after his painful defeat to Kaido, how will Luffy escape the excavation labor camp?!  For teen audiences. ",
    "title": "ONE PIECE GN VOL 93",
    "price": "$9.99",
    "creators": "(W) Eiichiro Oda (A/CA) Eiichiro Oda",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202198"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Freya thinks of herself as a simple village girl, but her idyllic life is shattered when she is caught up in the aftermath of a treacherous Sigurdian plot. She bears a striking resemblance to her country's beloved Prince Edvard, who lays dying from poison. Without its ruler, all of Tyr will quickly be engulfed by Sigurdian violence. Now Freya must take Prince Edvard's place and lead his valiant knights in defending the realm!  For older teen audiences. ",
    "title": "PRINCE FREYA GN VOL 01",
    "price": "$9.99",
    "creators": "(W) Keiko Ishihara (A/CA) Keiko Ishihara",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202200"
  },
  {
    "publisher": "PS ARTBOOKS",
    "description": "Considered by many to be from the true Golden Age (Pre-Comics Code) of horror comics! BEWARE! Terror Tales was one of the best and most unsettling. An anthology comic featuring horror stories, hosted by The Mummy, with contributors including Bernard Baily, Bob Powell, Mike Sekowsky, Ross Andru, Sheldon Moldoff, Bob McCarty, Maurice Gutwirth, and George Evans and you even get a little something extra with the inclusion of Fawcett's Bonus Motion Picture Comic, When Worlds Collide from May 1952. Collects BEWARE! Terror Tales #1-4 (May 1952 to November 1952), plus When Worlds Collide (May 1952).",
    "title": "PS ARTBOOKS BEWARE TERROR TALES SOFTEE VOL 01",
    "price": "$24.99",
    "creators": "(A) Bernard Baily, Bob Powell, Mike Sekowsky, Ross Andru, Shelly Moldoff, Robert McCarty, Maurice Gutwirth, George Evans",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201931"
  },
  {
    "publisher": "ONI PRESS INC.",
    "description": "Salvage vessel Cortes tracks the Lonely Orphan, a planet with no star system to call its own. Somewhere on this hostile rock is a payload fit for a king. To attain it, though, the crew of the Cortes must brave razor rock, poisonous vapors, treacherous footing, and... the most mind-numbing horrors imaginable. Something nightmarish is at work on Lonely Orphan. Something cruel. Something hungry.",
    "title": "ROGUE PLANET #1 CVR A MACDONALD",
    "price": "$3.99",
    "creators": "(W) Cullen Bunn (A/CA) Andy MacDonald",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201872"
  },
  {
    "publisher": "ONI PRESS INC.",
    "description": "Salvage vessel Cortes tracks the Lonely Orphan, a planet with no star system to call its own. Somewhere on this hostile rock is a payload fit for a king. To attain it, though, the crew of the Cortes must brave razor rock, poisonous vapors, treacherous footing, and... the most mind-numbing horrors imaginable. Something nightmarish is at work on Lonely Orphan. Something cruel. Something hungry.",
    "title": "ROGUE PLANET #1 CVR B STRAHM",
    "price": "$3.99",
    "creators": "(W) Cullen Bunn (A) Andy MacDonald (CA) Kyle Strahm",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201873"
  },
  {
    "publisher": "FANTAGRAPHICS BOOKS",
    "description": "Adam Kline is stuck in a university job, surrounded by academic boors and completely ignored by the New York art scene. Miraculously, a promotion appears and a high-end art dealer expresses interest in his work. However, he keeps blacking out at the most inopportune times and his perception of reality and fantasy begins to blur....This wryly funny tale is further enlivened, as Adam contends with an eerie, pitch-black void, flesh-eating zombies, and a network of bug-eyed aliens. As if getting by in NYC wasn't hard enough!",
    "title": "ROUGH PEARL GN",
    "price": "$22.99",
    "creators": "(W) Kevin Mutch",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201771"
  },
  {
    "publisher": "TOKYOPOP",
    "description": "After their search for the missing Great Priestess Lys leads Rin and Aghyr into trouble and an unexpected battle at the Water Sanctuary, they take some time to regroup among their friends of the Kaishin Clan. There, they meet up with the Fire Oracles Kara and Koru, who have prophesied the arrival of the Scarlet Soul&mdash; none other than Rin Shirano herself.With the Fire Oracles' help, Rin reclaims her sister's sword Hitaken, which has chosen her as its wielder. Whether she feels ready to take on the responsibility or not, she is the only one who can carry the ancient exorcist blade now. With demon activity increasing throughout the land, it's more important than ever that the Great Priestess is found as quickly as possible... even as forces gather that will stop at nothing to make sure Rin can never see her sister again!",
    "title": "SCARLET SOUL MANGA GN VOL 02",
    "price": "$10.99",
    "creators": "(W) Kira Yukishiro (A/CA) Kira Yukishiro",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202174"
  },
  {
    "publisher": "SUBLIME",
    "description": "Shohei loves bunnies! He loves them so much he's even taken to volunteering at a local pet shop. Store owner Mito is as sweet and kind as the fuzzy critters he cares for, and it's not long before Shohei finds himself wanting to cuddle with him as much as the bunnies! But Shohei is hiding a dangerous secret, one that makes this dream an unlikely reality.  For mature audiences. ",
    "title": "SECRET XXX GN (MR)",
    "price": "$12.99",
    "creators": "(W) Meguru Hinohara (A/CA) Meguru Hinohara",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202159"
  },
  {
    "publisher": "VAULT COMICS",
    "description": "After a devastating tragedy, Sera and Antares flee the besieged Setareh, while Aldebaran and Fomalhaut are ambushed in the Forgotten Sea. Separated and growing ever weaker, the Royal Stars must seek forbidden help--from Algol, the Demon Star.",
    "title": "SERA & ROYAL STARS #7",
    "price": "$3.99",
    "creators": "(W) Jon Tsuei (A/CA) Audrey Mok",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202089"
  },
  {
    "publisher": "TITAN COMICS",
    "description": "The critically acclaimed manga adaptation of Sherlock, featuring Irene Adler, reaches the climactic conclusion of its first arc!  It may seem all over for Sherlock, but there are mysteries still to be solved. Will he crack the code for Adler's phone and reveal the secrets of the scandal? Plus, John follows a call to meet with someone quite unexpected...",
    "title": "SHERLOCK SCANDAL IN BELGRAVIA #5 CVR A ZHANG",
    "price": "$4.99",
    "creators": "(W) Steven Moffat (A) Jay (CA) Alice X Zhang",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202012"
  },
  {
    "publisher": "TITAN COMICS",
    "description": "The critically acclaimed manga adaptation of Sherlock, featuring Irene Adler, reaches the climactic conclusion of its first arc!  It may seem all over for Sherlock, but there are mysteries still to be solved. Will he crack the code for Adler's phone and reveal the secrets of the scandal? Plus, John follows a call to meet with someone quite unexpected...",
    "title": "SHERLOCK SCANDAL IN BELGRAVIA #5 CVR B PHOTO",
    "price": "$4.99",
    "creators": "(W) Steven Moffat (A) Jay (CA) Photo",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202013"
  },
  {
    "publisher": "TITAN COMICS",
    "description": "The critically acclaimed manga adaptation of Sherlock, featuring Irene Adler, reaches the climactic conclusion of its first arc!  It may seem all over for Sherlock, but there are mysteries still to be solved. Will he crack the code for Adler's phone and reveal the secrets of the scandal? Plus, John follows a call to meet with someone quite unexpected...",
    "title": "SHERLOCK SCANDAL IN BELGRAVIA #5 CVR C JAY",
    "price": "$4.99",
    "creators": "(W) Steven Moffat (A/CA) Jay",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202014"
  },
  {
    "publisher": "PORTABLE PRESS",
    "description": "Long regarded as the greatest player in baseball history, George Herman \"Babe\" Ruth transformed the sport with his legendary power and personality. Babe Ruth: Baseball's All-Time Best! tells the story of Ruth's life in graphic novel format, from his humble beginnings in Baltimore to superstardom with the New York Yankees. Never one to keep quiet, Babe Ruth was a player whose outsized swing and character made him a star both on and off the field. Baseball fans of all ages will be entertained and educated by the full-color illustrations and historically accurate narrative of this graphical biography.",
    "title": "SHOW ME HISTORY GN BABE RUTH BASEBALLS ALL TIME BEST",
    "price": "$12.99",
    "creators": "(W) James Buckley Jr (A) Kelly Tindall",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201930"
  },
  {
    "publisher": "BLIZZARD ENTERTAINMENT",
    "description": "A fragile ceasefire exists between the Terrans, Protoss, and Zerg, but that hasn't stopped them from finding new ways to spill each other's blood. On a fringe world called Adena, a corrupt Dominion commander risks conflict between the three races for his own insatiable greed. The people who pay the price for his avarice are frontline grunts Elms, Contreras, and Yong. But for them, Adena is only the beginning of a long journey: one filled with deadly black-market deals, zerg infestation, and Elm's burgeoning psionic abilities.",
    "title": "STARCRAFT WARCHEST SHADOW WARS COMPLETE COLL",
    "price": "$14.95",
    "creators": "(W) Josh Elder, Richard A. Knaak, Paul Benjamin (A) Ramanda Kamarga, Naohiro Washio",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201626"
  },
  {
    "publisher": "STORM KING PRODUCTIONS, INC",
    "description": "Monica must use her own vicious powers to fight the werewolf before it kills her father. Yet the beast holds even more secrets that may cause an all out war.",
    "title": "STORM KIDS MONICA BLEUE WEREWOLF STORY #5 (OF 5)",
    "price": "$3.99",
    "creators": "(W) Steve Niles (A/CA) Damien Worm",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201994"
  },
  {
    "publisher": "AVATAR PRESS INC",
    "description": "Original First Printing special editions that were previously only available as retailer ordering incentives!",
    "title": "SUPERGOD #1 CHURCH OF THE SUPERGOD VAR (MR)",
    "price": "$5.99",
    "creators": "(CA) Garrie Gastony",
    "release_date": "2020-05-27",
    "diamond_id": "NOV191550"
  },
  {
    "publisher": "FANTAGRAPHICS BOOKS",
    "description": "In Tad Martin: Tears of the Leather-bound Saints, Cassanova Frankenstein invades the straight world with his madcap ink line and macabre vision. When the author's coolly detached avatar gets fired from his shitty manual labor job, he spits bitter truths about insidious corporate greed and the soul-crushing rat race. From there, in a series of emotionally raw vignettes, he offers glimpses into his rough upbringing, from his dysfunctional home life to his childhood insecurities and racial anxieties - ultimately revealing the roots of his punk sensibility. A deeply vulnerable work from a true comics outsider.",
    "title": "TAD MARTIN TEARS OF LEATHER BOUND SAINTS GN  (MR)",
    "price": "$PI",
    "creators": "(W) Casanova Frankenstein (A/CA) Casanova Frankenstein",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191683"
  },
  {
    "publisher": "CONUNDRUM PRESS",
    "description": "Surveying the work of 40 contemporary Canadian artists, This Is Serious showcases the energy of underground artistic production and indie publishing, expressed through a diverse range of artists. Co-curated by Alana Traficante and award-winning cartoonist Joe Ollmann, This Is Serious presents the recent arc of production that has helped shaped the current state of graphic storytelling, here and now, on home soil. With contributions from Jeet Heer and Peggy Burns.",
    "title": "THIS IS SERIOUS CANADIAN INDIE COMICS SC",
    "price": "$25.00",
    "creators": "",
    "release_date": "2020-05-27",
    "diamond_id": "FEB201688"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "The Ghoul-CCG alliance secures its first victory when it rescues Kaneki from the monster he was entombed within. But the creature still poses a dire threat to the city as it continues to birth mutant Ghouls, some of which are infecting humans with a horrific form of Ghoulism! The only cure lies deep in the belly of the beast itself, and Kaneki is determined to find it. But will this act of bravery be the final strike to end the war or Kaneki's last stand?!  For older teen audiences. ",
    "title": "TOKYO GHOUL RE GN VOL 16",
    "price": "$12.99",
    "creators": "(W) Sui Ishida (A/CA) Sui Ishida",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202193"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "In Hong Kong, the battle of the SSSP versus the Star Cluster Council continues with Shinjiro and Red joining Moroboshi and Adad to face off against the Leo brothers. The Star Cluster Council now seems to view the Ultra race and their enormous powers as a potential threat to the universe. But is this the true belief of the council or just a smoke screen for another, darker agenda?  For teen audiences. ",
    "title": "ULTRAMAN GN VOL 13",
    "price": "$12.99",
    "creators": "(W) Eiichi Shimizu (A/CA) Eiichi Shimizu",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202211"
  },
  {
    "publisher": "ANTARCTIC PRESS",
    "description": "Two worlds collide at the Larry Hama signing! In this final issue, someone dies! Will it be Jonathan? Talia? Chan Haan Sing?! Not even Larry is safe!!!",
    "title": "V CARD #4 (OF 4)",
    "price": "$3.99",
    "creators": "(W) Dallas Casavant (A) Nick Johson",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201502"
  },
  {
    "publisher": "BLIZZARD ENTERTAINMENT",
    "description": "Aodhan comes from a lineage that includes some of Azeroth's most heroic paladins and warriors, but the whip-smart young man is not built for physical combat. He's thin, bookish, and he desperately wants to be a mage. After his controlling father forbids him to practice magic, Aodhan flees to study the arcane arts in the city of Dalaran. Yet Aodhan's dream of becoming a powerful spellcaster is violently interrupted when a host of blue dragons lays siege to Dalaran. But there is a darker secret behind Dalaran's dire situation, and Aodhan might be the only one who can end the schemes that threaten the city, becoming the hero his family never thought he could be.",
    "title": "WARCRAFT MAGE GN WOW",
    "price": "$12.95",
    "creators": "(W) Richard A. Knaak (A/CA) Ryo Kawakami",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201627"
  },
  {
    "publisher": "VIZ MEDIA LLC",
    "description": "Some people are bad at cooking, but Mafuyu Kirisu is bad on a whole new level! It takes more than a cute apron to be a great chef. Plus, Uruka gets some life-changing news... How will it alter her relationship with Nariyuki?",
    "title": "WE NEVER LEARN GN VOL 09",
    "price": "$9.99",
    "creators": "(W) Taishi Tsutsui (A/CA) Taishi Tsutsui",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202206"
  },
  {
    "publisher": "CLOVER PRESS, LLC",
    "description": "Matt Bors makes the bold declaration that We Should Improve Society Somewhat in this collection of comics from The Nib's Editor and Publisher, Matt Bors. Bors has been working as a cartoonist for more than a decade, and this new collection captures a mix of his timely strips based on today's incredibly politically-divided environment, along with a curated selection of his timelessly funny earlier strips.",
    "title": "WE SHOULD IMPROVE SOCIETY SOMEWHAT TP",
    "price": "$24.99",
    "creators": "(W) Matt Bors (A/CA) Matt Bors",
    "release_date": "2020-05-27",
    "diamond_id": "JAN201703"
  },
  {
    "publisher": "SUBLIME",
    "description": "Manga editor Ritsu Onodera is as busy as ever working for Marukawa Publishing's Emerald shojo imprint under his demanding boss-and first love!-Masamune Takano. After a recent run-in with Nao, an old friend from high school, Ritsu is flooded with memories of his time abroad spent mending his broken heart after his split from Takano. But instead of Nao reassuring his old friend, he decides now is the time to tell Ritsu how he really feels!  For mature readers.",
    "title": "WORLDS GREATEST FIRST LOVE GN VOL 13 (MR)",
    "price": "$12.99",
    "creators": "(W) Shungiku Nakamura (A/CA) Shungiku Nakamura",
    "release_date": "2020-05-27",
    "diamond_id": "FEB202160"
  },
  {
    "publisher": "GHOST SHIP",
    "description": "Tsurugi and Yatsuki have come to blows over their differences; are yokai merely tools to be used, or can they be trusted friends? Not only is Yatsuki fighter for his very beliefs, he and the Yokai Girls have to figure out how to overcome an opponent who can perform ethereal fusion with two powerful yokai at once!",
    "title": "YOKAI GIRLS GN VOL 10 (MR)",
    "price": "$13.99",
    "creators": "(W) Kazuki Funatsu (A/CA) Kazuki Funatsu",
    "release_date": "2020-05-27",
    "diamond_id": "JAN202136"
  },
  {
    "publisher": "ACTION LAB - DANGER ZONE",
    "description": "Angel Lynch finds herself in Rome, Italy, and smack dab at the center of a necromancer conspiracy that will change everything she thought she knew about religion! Also, she discovers that her powers are beginning to manifest in strange and exciting ways. And not only is her power set growing - so are her companions as a new cast of characters also emerges in this thrilling new story arc! Collects issues #65-68 of the wildly popular ongoing series! ",
    "title": "ZOMBIE TRAMP TP VOL 19 DEAD GIRL IN EUROPE",
    "price": "$14.99",
    "creators": "(W) Vince Hernandez (A/CA) Marco Maccagni",
    "release_date": "2020-05-27",
    "diamond_id": "DEC191327"
  }
]
